apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
/************************************************************************************
 * arch/arm/src/imxrt/chip/imxrt_flexpwm.h
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Authors: Gregory Nutt <gnutt@nuttx.org>
 *            David Sidrane <david_s5@nscdg.com>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_IMXRT_CHIP_IMXRT_FLEXPWM_H
#define __ARCH_ARM_SRC_IMXRT_CHIP_IMXRT_FLEXPWM_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>
#include "chip/imxrt_memorymap.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* Register Offsets *****************************************************************/

#define IMXRT_FLEXPWM_SM0CNT_OFFSET          0x0000  /* Counter Register */
#define IMXRT_FLEXPWM_SM0INIT_OFFSET         0x0002  /* Initial Count Register */
#define IMXRT_FLEXPWM_SM0CTRL2_OFFSET        0x0004  /* Control 2 Register */
#define IMXRT_FLEXPWM_SM0CTRL_OFFSET         0x0006  /* Control Register */
#define IMXRT_FLEXPWM_SM0VAL0_OFFSET         0x000a  /* Value Register 0 */
#define IMXRT_FLEXPWM_SM0FRACVAL1_OFFSET     0x000c  /* Fractional Value Register 1 */
#define IMXRT_FLEXPWM_SM0VAL1_OFFSET         0x000e  /* Value Register 1 */
#define IMXRT_FLEXPWM_SM0FRACVAL2_OFFSET     0x0010  /* Fractional Value Register 2 */
#define IMXRT_FLEXPWM_SM0VAL2_OFFSET         0x0012  /* Value Register 2 */
#define IMXRT_FLEXPWM_SM0FRACVAL3_OFFSET     0x0014  /* Fractional Value Register 3 */
#define IMXRT_FLEXPWM_SM0VAL3_OFFSET         0x0016  /* Value Register 3 */
#define IMXRT_FLEXPWM_SM0FRACVAL4_OFFSET     0x0018  /* Fractional Value Register 4 */
#define IMXRT_FLEXPWM_SM0VAL4_OFFSET         0x001a  /* Value Register 4 */
#define IMXRT_FLEXPWM_SM0FRACVAL5_OFFSET     0x001c  /* Fractional Value Register 5 */
#define IMXRT_FLEXPWM_SM0VAL5_OFFSET         0x001e  /* Value Register 5 */
#define IMXRT_FLEXPWM_SM0FRCTRL_OFFSET       0x0020  /* Fractional Control Register */
#define IMXRT_FLEXPWM_SM0OCTRL_OFFSET        0x0022  /* Output Control Register */
#define IMXRT_FLEXPWM_SM0STS_OFFSET          0x0024  /* Status Register */
#define IMXRT_FLEXPWM_SM0INTEN_OFFSET        0x0026  /* Interrupt Enable Register */
#define IMXRT_FLEXPWM_SM0DMAEN_OFFSET        0x0028  /* DMA Enable Register */
#define IMXRT_FLEXPWM_SM0TCTRL_OFFSET        0x002a  /* Output Trigger Control Register */
#define IMXRT_FLEXPWM_SM0DISMAP0_OFFSET      0x002c  /* Fault Disable Mapping Register 0 */
#define IMXRT_FLEXPWM_SM0DISMAP1_OFFSET      0x002e  /* Fault Disable Mapping Register 1 */
#define IMXRT_FLEXPWM_SM0DTCNT0_OFFSET       0x0030  /* Deadtime Count Register 0 */
#define IMXRT_FLEXPWM_SM0DTCNT1_OFFSET       0x0032  /* Deadtime Count Register 1 */
#define IMXRT_FLEXPWM_SM0CAPTCTRLA_OFFSET    0x0034  /* Capture Control A Register */
#define IMXRT_FLEXPWM_SM0CAPTCOMPA_OFFSET    0x0036  /* Capture Compare A Register */
#define IMXRT_FLEXPWM_SM0CAPTCTRLB_OFFSET    0x0038  /* Capture Control B Register */
#define IMXRT_FLEXPWM_SM0CAPTCOMPB_OFFSET    0x003a  /* Capture Compare B Register */
#define IMXRT_FLEXPWM_SM0CAPTCTRLX_OFFSET    0x003c  /* Capture Control X Register */
#define IMXRT_FLEXPWM_SM0CAPTCOMPX_OFFSET    0x003e  /* Capture Compare X Register */
#define IMXRT_FLEXPWM_SM0CVAL0_OFFSET        0x0040  /* Capture Value 0 Register */
#define IMXRT_FLEXPWM_SM0CVAL0CYC_OFFSET     0x0042  /* Capture Value 0 Cycle Register */
#define IMXRT_FLEXPWM_SM0CVAL1_OFFSET        0x0044  /* Capture Value 1 Register */
#define IMXRT_FLEXPWM_SM0CVAL1CYC_OFFSET     0x0046  /* Capture Value 1 Cycle Register */
#define IMXRT_FLEXPWM_SM0CVAL2_OFFSET        0x0048  /* Capture Value 2 Register */
#define IMXRT_FLEXPWM_SM0CVAL2CYC_OFFSET     0x004a  /* Capture Value 2 Cycle Register */
#define IMXRT_FLEXPWM_SM0CVAL3_OFFSET        0x004c  /* Capture Value 3 Register */
#define IMXRT_FLEXPWM_SM0CVAL3CYC_OFFSET     0x004e  /* Capture Value 3 Cycle Register */
#define IMXRT_FLEXPWM_SM0CVAL4_OFFSET        0x0050  /* Capture Value 4 Register */
#define IMXRT_FLEXPWM_SM0CVAL4CYC_OFFSET     0x0052  /* Capture Value 4 Cycle Register */
#define IMXRT_FLEXPWM_SM0CVAL5_OFFSET        0x0054  /* Capture Value 5 Register */
#define IMXRT_FLEXPWM_SM0CVAL5CYC_OFFSET     0x0056  /* Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM_SM1CNT_OFFSET          0x0060  /* Counter Register */
#define IMXRT_FLEXPWM_SM1INIT_OFFSET         0x0062  /* Initial Count Register */
#define IMXRT_FLEXPWM_SM1CTRL2_OFFSET        0x0064  /* Control 2 Register */
#define IMXRT_FLEXPWM_SM1CTRL_OFFSET         0x0066  /* Control Register */
#define IMXRT_FLEXPWM_SM1VAL0_OFFSET         0x006a  /* Value Register 0 */
#define IMXRT_FLEXPWM_SM1FRACVAL1_OFFSET     0x006c  /* Fractional Value Register 1 */
#define IMXRT_FLEXPWM_SM1VAL1_OFFSET         0x006e  /* Value Register 1 */
#define IMXRT_FLEXPWM_SM1FRACVAL2_OFFSET     0x0070  /* Fractional Value Register 2 */
#define IMXRT_FLEXPWM_SM1VAL2_OFFSET         0x0072  /* Value Register 2 */
#define IMXRT_FLEXPWM_SM1FRACVAL3_OFFSET     0x0074  /* Fractional Value Register 3 */
#define IMXRT_FLEXPWM_SM1VAL3_OFFSET         0x0076  /* Value Register 3 */
#define IMXRT_FLEXPWM_SM1FRACVAL4_OFFSET     0x0078  /* Fractional Value Register 4 */
#define IMXRT_FLEXPWM_SM1VAL4_OFFSET         0x007a  /* Value Register 4 */
#define IMXRT_FLEXPWM_SM1FRACVAL5_OFFSET     0x007c  /* Fractional Value Register 5 */
#define IMXRT_FLEXPWM_SM1VAL5_OFFSET         0x007e  /* Value Register 5 */
#define IMXRT_FLEXPWM_SM1FRCTRL_OFFSET       0x0080  /* Fractional Control Register */
#define IMXRT_FLEXPWM_SM1OCTRL_OFFSET        0x0082  /* Output Control Register */
#define IMXRT_FLEXPWM_SM1STS_OFFSET          0x0084  /* Status Register */
#define IMXRT_FLEXPWM_SM1INTEN_OFFSET        0x0086  /* Interrupt Enable Register */
#define IMXRT_FLEXPWM_SM1DMAEN_OFFSET        0x0088  /* DMA Enable Register */
#define IMXRT_FLEXPWM_SM1TCTRL_OFFSET        0x008a  /* Output Trigger Control Register */
#define IMXRT_FLEXPWM_SM1DISMAP0_OFFSET      0x008c  /* Fault Disable Mapping Register 0 */
#define IMXRT_FLEXPWM_SM1DISMAP1_OFFSET      0x008e  /* Fault Disable Mapping Register 1 */
#define IMXRT_FLEXPWM_SM1DTCNT0_OFFSET       0x0090  /* Deadtime Count Register 0 */
#define IMXRT_FLEXPWM_SM1DTCNT1_OFFSET       0x0092  /* Deadtime Count Register 1 */
#define IMXRT_FLEXPWM_SM1CAPTCTRLA_OFFSET    0x0094  /* Capture Control A Register */
#define IMXRT_FLEXPWM_SM1CAPTCOMPA_OFFSET    0x0096  /* Capture Compare A Register */
#define IMXRT_FLEXPWM_eFlexPWM_OFFSET        0x000c  /* apter 28 Enhanced Flex Pulse Width Modulator */
#define IMXRT_FLEXPWM_SM1CAPTCTRLB_OFFSET    0x0098  /* Capture Control B Register */
#define IMXRT_FLEXPWM_SM1CAPTCOMPB_OFFSET    0x009a  /* Capture Compare B Register */
#define IMXRT_FLEXPWM_SM1CAPTCTRLX_OFFSET    0x009c  /* Capture Control X Register */
#define IMXRT_FLEXPWM_SM1CAPTCOMPX_OFFSET    0x009e  /* Capture Compare X Register */
#define IMXRT_FLEXPWM_SM1CVAL0_OFFSET        0x00a0  /* Capture Value 0 Register */
#define IMXRT_FLEXPWM_SM1CVAL0CYC_OFFSET     0x00a2  /* Capture Value 0 Cycle Register */
#define IMXRT_FLEXPWM_SM1CVAL1_OFFSET        0x00a4  /* Capture Value 1 Register */
#define IMXRT_FLEXPWM_SM1CVAL1CYC_OFFSET     0x00a6  /* Capture Value 1 Cycle Register */
#define IMXRT_FLEXPWM_SM1CVAL2_OFFSET        0x00a8  /* Capture Value 2 Register */
#define IMXRT_FLEXPWM_SM1CVAL2CYC_OFFSET     0x00aa  /* Capture Value 2 Cycle Register */
#define IMXRT_FLEXPWM_SM1CVAL3_OFFSET        0x00ac  /* Capture Value 3 Register */
#define IMXRT_FLEXPWM_SM1CVAL3CYC_OFFSET     0x00ae  /* Capture Value 3 Cycle Register */
#define IMXRT_FLEXPWM_SM1CVAL4_OFFSET        0x00b0  /* Capture Value 4 Register */
#define IMXRT_FLEXPWM_SM1CVAL4CYC_OFFSET     0x00b2  /* Capture Value 4 Cycle Register */
#define IMXRT_FLEXPWM_SM1CVAL5_OFFSET        0x00b4  /* Capture Value 5 Register */
#define IMXRT_FLEXPWM_SM1CVAL5CYC_OFFSET     0x00b6  /* Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM_SM2CNT_OFFSET          0x00c0  /* Counter Register */
#define IMXRT_FLEXPWM_SM2INIT_OFFSET         0x00c2  /* Initial Count Register */
#define IMXRT_FLEXPWM_SM2CTRL2_OFFSET        0x00c4  /* Control 2 Register */
#define IMXRT_FLEXPWM_SM2CTRL_OFFSET         0x00c6  /* Control Register */
#define IMXRT_FLEXPWM_SM2VAL0_OFFSET         0x00ca  /* Value Register 0 */
#define IMXRT_FLEXPWM_SM2FRACVAL1_OFFSET     0x00cc  /* Fractional Value Register 1 */
#define IMXRT_FLEXPWM_SM2VAL1_OFFSET         0x00ce  /* Value Register 1 */
#define IMXRT_FLEXPWM_SM2FRACVAL2_OFFSET     0x00d0  /* Fractional Value Register 2 */
#define IMXRT_FLEXPWM_SM2VAL2_OFFSET         0x00d2  /* Value Register 2 */
#define IMXRT_FLEXPWM_SM2FRACVAL3_OFFSET     0x00d4  /* Fractional Value Register 3 */
#define IMXRT_FLEXPWM_SM2VAL3_OFFSET         0x00d6  /* Value Register 3 */
#define IMXRT_FLEXPWM_SM2FRACVAL4_OFFSET     0x00d8  /* Fractional Value Register 4 */
#define IMXRT_FLEXPWM_SM2VAL4_OFFSET         0x00da  /* Value Register 4 */
#define IMXRT_FLEXPWM_SM2FRACVAL5_OFFSET     0x00dc  /* Fractional Value Register 5 */
#define IMXRT_FLEXPWM_SM2VAL5_OFFSET         0x00de  /* Value Register 5 */
#define IMXRT_FLEXPWM_SM2FRCTRL_OFFSET       0x00e0  /* Fractional Control Register */
#define IMXRT_FLEXPWM_SM2OCTRL_OFFSET        0x00e2  /* Output Control Register */
#define IMXRT_FLEXPWM_SM2STS_OFFSET          0x00e4  /* Status Register */
#define IMXRT_FLEXPWM_SM2INTEN_OFFSET        0x00e6  /* Interrupt Enable Register */
#define IMXRT_FLEXPWM_SM2DMAEN_OFFSET        0x00e8  /* DMA Enable Register */
#define IMXRT_FLEXPWM_SM2TCTRL_OFFSET        0x00ea  /* Output Trigger Control Register */
#define IMXRT_FLEXPWM_SM2DISMAP0_OFFSET      0x00ec  /* Fault Disable Mapping Register 0 */
#define IMXRT_FLEXPWM_SM2DISMAP1_OFFSET      0x00ee  /* Fault Disable Mapping Register 1 */
#define IMXRT_FLEXPWM_SM2DTCNT0_OFFSET       0x00f0  /* Deadtime Count Register 0 */
#define IMXRT_FLEXPWM_SM2DTCNT1_OFFSET       0x00f2  /* Deadtime Count Register 1 */
#define IMXRT_FLEXPWM_SM2CAPTCTRLA_OFFSET    0x00f4  /* Capture Control A Register */
#define IMXRT_FLEXPWM_SM2CAPTCOMPA_OFFSET    0x00f6  /* Capture Compare A Register */
#define IMXRT_FLEXPWM_SM2CAPTCTRLB_OFFSET    0x00f8  /* Capture Control B Register */
#define IMXRT_FLEXPWM_SM2CAPTCOMPB_OFFSET    0x00fa  /* Capture Compare B Register */
#define IMXRT_FLEXPWM_SM2CAPTCTRLX_OFFSET    0x00fc  /* Capture Control X Register */
#define IMXRT_FLEXPWM_SM2CAPTCOMPX_OFFSET    0x00fe  /* Capture Compare X Register */
#define IMXRT_FLEXPWM_SM2CVAL0_OFFSET        0x0100  /* Capture Value 0 Register */
#define IMXRT_FLEXPWM_SM2CVAL0CYC_OFFSET     0x0102  /* Capture Value 0 Cycle Register */
#define IMXRT_FLEXPWM_SM2CVAL1_OFFSET        0x0104  /* Capture Value 1 Register */
#define IMXRT_FLEXPWM_SM2CVAL1CYC_OFFSET     0x0106  /* Capture Value 1 Cycle Register */
#define IMXRT_FLEXPWM_SM2CVAL2_OFFSET        0x0108  /* Capture Value 2 Register */
#define IMXRT_FLEXPWM_SM2CVAL2CYC_OFFSET     0x010a  /* Capture Value 2 Cycle Register */
#define IMXRT_FLEXPWM_SM2CVAL3_OFFSET        0x010c  /* Capture Value 3 Register */
#define IMXRT_FLEXPWM_SM2CVAL3CYC_OFFSET     0x010e  /* Capture Value 3 Cycle Register */
#define IMXRT_FLEXPWM_SM2CVAL4_OFFSET        0x0110  /* Capture Value 4 Register */
#define IMXRT_FLEXPWM_SM2CVAL4CYC_OFFSET     0x0112  /* Capture Value 4 Cycle Register */
#define IMXRT_FLEXPWM_SM2CVAL5_OFFSET        0x0114  /* Capture Value 5 Register */
#define IMXRT_FLEXPWM_SM2CVAL5CYC_OFFSET     0x0116  /* Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM_SM3CNT_OFFSET          0x0120  /* Counter Register */
#define IMXRT_FLEXPWM_SM3INIT_OFFSET         0x0122  /* Initial Count Register */
#define IMXRT_FLEXPWM_SM3CTRL2_OFFSET        0x0124  /* Control 2 Register */
#define IMXRT_FLEXPWM_SM3CTRL_OFFSET         0x0126  /* Control Register */
#define IMXRT_FLEXPWM_SM3VAL0_OFFSET         0x012a  /* Value Register 0 */
#define IMXRT_FLEXPWM_SM3FRACVAL1_OFFSET     0x012c  /* Fractional Value Register 1 */
#define IMXRT_FLEXPWM_SM3VAL1_OFFSET         0x012e  /* Value Register 1 */
#define IMXRT_FLEXPWM_SM3FRACVAL2_OFFSET     0x0130  /* Fractional Value Register 2 */
#define IMXRT_FLEXPWM_SM3VAL2_OFFSET         0x0132  /* Value Register 2 */
#define IMXRT_FLEXPWM_SM3FRACVAL3_OFFSET     0x0134  /* Fractional Value Register 3 */
#define IMXRT_FLEXPWM_SM3VAL3_OFFSET         0x0136  /* Value Register 3 */
#define IMXRT_FLEXPWM_SM3FRACVAL4_OFFSET     0x0138  /* Fractional Value Register 4 */
#define IMXRT_FLEXPWM_SM3VAL4_OFFSET         0x013a  /* Value Register 4 */
#define IMXRT_FLEXPWM_SM3FRACVAL5_OFFSET     0x013c  /* Fractional Value Register 5 */
#define IMXRT_FLEXPWM_SM3VAL5_OFFSET         0x013e  /* Value Register 5 */
#define IMXRT_FLEXPWM_SM3FRCTRL_OFFSET       0x0140  /* Fractional Control Register */
#define IMXRT_FLEXPWM_SM3OCTRL_OFFSET        0x0142  /* Output Control Register */
#define IMXRT_FLEXPWM_SM3STS_OFFSET          0x0144  /* Status Register */
#define IMXRT_FLEXPWM_SM3INTEN_OFFSET        0x0146  /* Interrupt Enable Register */
#define IMXRT_FLEXPWM_SM3DMAEN_OFFSET        0x0148  /* DMA Enable Register */
#define IMXRT_FLEXPWM_SM3TCTRL_OFFSET        0x014a  /* Output Trigger Control Register */
#define IMXRT_FLEXPWM_SM3DISMAP0_OFFSET      0x014c  /* Fault Disable Mapping Register 0 */
#define IMXRT_FLEXPWM_SM3DISMAP1_OFFSET      0x014e  /* Fault Disable Mapping Register 1 */
#define IMXRT_FLEXPWM_SM3DTCNT0_OFFSET       0x0150  /* Deadtime Count Register 0 */
#define IMXRT_FLEXPWM_SM3DTCNT1_OFFSET       0x0152  /* Deadtime Count Register 1 */
#define IMXRT_FLEXPWM_SM3CAPTCTRLA_OFFSET    0x0154  /* Capture Control A Register */
#define IMXRT_FLEXPWM_SM3CAPTCOMPA_OFFSET    0x0156  /* Capture Compare A Register */
#define IMXRT_FLEXPWM_SM3CAPTCTRLB_OFFSET    0x0158  /* Capture Control B Register */
#define IMXRT_FLEXPWM_SM3CAPTCOMPB_OFFSET    0x015a  /* Capture Compare B Register */
#define IMXRT_FLEXPWM_SM3CAPTCTRLX_OFFSET    0x015c  /* Capture Control X Register */
#define IMXRT_FLEXPWM_SM3CAPTCOMPX_OFFSET    0x015e  /* Capture Compare X Register */
#define IMXRT_FLEXPWM_SM3CVAL0_OFFSET        0x0160  /* Capture Value 0 Register */
#define IMXRT_FLEXPWM_SM3CVAL0CYC_OFFSET     0x0162  /* Capture Value 0 Cycle Register */
#define IMXRT_FLEXPWM_SM3CVAL1_OFFSET        0x0164  /* Capture Value 1 Register */
#define IMXRT_FLEXPWM_SM3CVAL1CYC_OFFSET     0x0166  /* Capture Value 1 Cycle Register */
#define IMXRT_FLEXPWM_SM3CVAL2_OFFSET        0x0168  /* Capture Value 2 Register */
#define IMXRT_FLEXPWM_SM3CVAL2CYC_OFFSET     0x016a  /* Capture Value 2 Cycle Register */
#define IMXRT_FLEXPWM_SM3CVAL3_OFFSET        0x016c  /* Capture Value 3 Register */
#define IMXRT_FLEXPWM_SM3CVAL3CYC_OFFSET     0x016e  /* Capture Value 3 Cycle Register */
#define IMXRT_FLEXPWM_SM3CVAL4_OFFSET        0x0170  /* Capture Value 4 Register */
#define IMXRT_FLEXPWM_SM3CVAL4CYC_OFFSET     0x0172  /* Capture Value 4 Cycle Register */
#define IMXRT_FLEXPWM_SM3CVAL5_OFFSET        0x0174  /* Capture Value 5 Register */
#define IMXRT_FLEXPWM_SM3CVAL5CYC_OFFSET     0x0176  /* Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM_OUTEN_OFFSET           0x0180  /* Output Enable Register */
#define IMXRT_FLEXPWM_MASK_OFFSET            0x0182  /* Mask Register */
#define IMXRT_FLEXPWM_SWCOUT_OFFSET          0x0184  /* Software Controlled Output Register */
#define IMXRT_FLEXPWM_DTSRCSEL_OFFSET        0x0186  /* PWM Source Select Register */
#define IMXRT_FLEXPWM_MCTRL_OFFSET           0x0188  /* Master Control Register */
#define IMXRT_FLEXPWM_MCTRL2_OFFSET          0x018a  /* Master Control 2 Register */
#define IMXRT_FLEXPWM_FCTRL0_OFFSET          0x018c  /* Fault Control Register */
#define IMXRT_FLEXPWM_FSTS0_OFFSET           0x018e  /* Fault Status Register */
#define IMXRT_FLEXPWM_FFILT0_OFFSET          0x0190  /* Fault Filter Register */
#define IMXRT_FLEXPWM_FTST0_OFFSET           0x0192  /* Fault Test Register */
#define IMXRT_FLEXPWM_FCTRL20_OFFSET         0x0194  /* Fault Control 2 Register */

/* Register addresses ***********************************************************************/

