apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
/* FLEXPWM1 Register Addresses */

#define IMXRT_FLEXPWM1_SM0CNT                (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CNT_OFFSET)        /* FLEXPWM1 Counter Register */
#define IMXRT_FLEXPWM1_SM0INIT               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0INIT_OFFSET)       /* FLEXPWM1 Initial Count Register */
#define IMXRT_FLEXPWM1_SM0CTRL2              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CTRL2_OFFSET)      /* FLEXPWM1 Control 2 Register */
#define IMXRT_FLEXPWM1_SM0CTRL               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CTRL_OFFSET)       /* FLEXPWM1 Control Register */
#define IMXRT_FLEXPWM1_SM0VAL0               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0VAL0_OFFSET)       /* FLEXPWM1 Value Register 0 */
#define IMXRT_FLEXPWM1_SM0FRACVAL1           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0FRACVAL1_OFFSET)   /* FLEXPWM1 Fractional Value Register 1 */
#define IMXRT_FLEXPWM1_SM0VAL1               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0VAL1_OFFSET)       /* FLEXPWM1 Value Register 1 */
#define IMXRT_FLEXPWM1_SM0FRACVAL2           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0FRACVAL2_OFFSET)   /* FLEXPWM1 Fractional Value Register 2 */
#define IMXRT_FLEXPWM1_SM0VAL2               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0VAL2_OFFSET)       /* FLEXPWM1 Value Register 2 */
#define IMXRT_FLEXPWM1_SM0FRACVAL3           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0FRACVAL3_OFFSET)   /* FLEXPWM1 Fractional Value Register 3 */
#define IMXRT_FLEXPWM1_SM0VAL3               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0VAL3_OFFSET)       /* FLEXPWM1 Value Register 3 */
#define IMXRT_FLEXPWM1_SM0FRACVAL4           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0FRACVAL4_OFFSET)   /* FLEXPWM1 Fractional Value Register 4 */
#define IMXRT_FLEXPWM1_SM0VAL4               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0VAL4_OFFSET)       /* FLEXPWM1 Value Register 4 */
#define IMXRT_FLEXPWM1_SM0FRACVAL5           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0FRACVAL5_OFFSET)   /* FLEXPWM1 Fractional Value Register 5 */
#define IMXRT_FLEXPWM1_SM0VAL5               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0VAL5_OFFSET)       /* FLEXPWM1 Value Register 5 */
#define IMXRT_FLEXPWM1_SM0FRCTRL             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0FRCTRL_OFFSET)     /* FLEXPWM1 Fractional Control Register */
#define IMXRT_FLEXPWM1_SM0OCTRL              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0OCTRL_OFFSET)      /* FLEXPWM1 Output Control Register */
#define IMXRT_FLEXPWM1_SM0STS                (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0STS_OFFSET)        /* FLEXPWM1 Status Register */
#define IMXRT_FLEXPWM1_SM0INTEN              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0INTEN_OFFSET)      /* FLEXPWM1 Interrupt Enable Register */
#define IMXRT_FLEXPWM1_SM0DMAEN              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0DMAEN_OFFSET)      /* FLEXPWM1 DMA Enable Register */
#define IMXRT_FLEXPWM1_SM0TCTRL              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0TCTRL_OFFSET)      /* FLEXPWM1 Output Trigger Control Register */
#define IMXRT_FLEXPWM1_SM0DISMAP0            (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0DISMAP0_OFFSET)    /* FLEXPWM1 Fault Disable Mapping Register 0 */
#define IMXRT_FLEXPWM1_SM0DISMAP1            (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0DISMAP1_OFFSET)    /* FLEXPWM1 Fault Disable Mapping Register 1 */
#define IMXRT_FLEXPWM1_SM0DTCNT0             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0DTCNT0_OFFSET)     /* FLEXPWM1 Deadtime Count Register 0 */
#define IMXRT_FLEXPWM1_SM0DTCNT1             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0DTCNT1_OFFSET)     /* FLEXPWM1 Deadtime Count Register 1 */
#define IMXRT_FLEXPWM1_SM0CAPTCTRLA          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CAPTCTRLA_OFFSET)  /* FLEXPWM1 Capture Control A Register */
#define IMXRT_FLEXPWM1_SM0CAPTCOMPA          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CAPTCOMPA_OFFSET)  /* FLEXPWM1 Capture Compare A Register */
#define IMXRT_FLEXPWM1_SM0CAPTCTRLB          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CAPTCTRLB_OFFSET)  /* FLEXPWM1 Capture Control B Register */
#define IMXRT_FLEXPWM1_SM0CAPTCOMPB          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CAPTCOMPB_OFFSET)  /* FLEXPWM1 Capture Compare B Register */
#define IMXRT_FLEXPWM1_SM0CAPTCTRLX          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CAPTCTRLX_OFFSET)  /* FLEXPWM1 Capture Control X Register */
#define IMXRT_FLEXPWM1_SM0CAPTCOMPX          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CAPTCOMPX_OFFSET)  /* FLEXPWM1 Capture Compare X Register */
#define IMXRT_FLEXPWM1_SM0CVAL0              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL0_OFFSET)      /* FLEXPWM1 Capture Value 0 Register */
#define IMXRT_FLEXPWM1_SM0CVAL0CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL0CYC_OFFSET)   /* FLEXPWM1 Capture Value 0 Cycle Register */
#define IMXRT_FLEXPWM1_SM0CVAL1              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL1_OFFSET)      /* FLEXPWM1 Capture Value 1 Register */
#define IMXRT_FLEXPWM1_SM0CVAL1CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL1CYC_OFFSET)   /* FLEXPWM1 Capture Value 1 Cycle Register */
#define IMXRT_FLEXPWM1_SM0CVAL2              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL2_OFFSET)      /* FLEXPWM1 Capture Value 2 Register */
#define IMXRT_FLEXPWM1_SM0CVAL2CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL2CYC_OFFSET)   /* FLEXPWM1 Capture Value 2 Cycle Register */
#define IMXRT_FLEXPWM1_SM0CVAL3              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL3_OFFSET)      /* FLEXPWM1 Capture Value 3 Register */
#define IMXRT_FLEXPWM1_SM0CVAL3CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL3CYC_OFFSET)   /* FLEXPWM1 Capture Value 3 Cycle Register */
#define IMXRT_FLEXPWM1_SM0CVAL4              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL4_OFFSET)      /* FLEXPWM1 Capture Value 4 Register */
#define IMXRT_FLEXPWM1_SM0CVAL4CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL4CYC_OFFSET)   /* FLEXPWM1 Capture Value 4 Cycle Register */
#define IMXRT_FLEXPWM1_SM0CVAL5              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL5_OFFSET)      /* FLEXPWM1 Capture Value 5 Register */
#define IMXRT_FLEXPWM1_SM0CVAL5CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM0CVAL5CYC_OFFSET)   /* FLEXPWM1 Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM1_SM1CNT                (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CNT_OFFSET)        /* FLEXPWM1 Counter Register */
#define IMXRT_FLEXPWM1_SM1INIT               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1INIT_OFFSET)       /* FLEXPWM1 Initial Count Register */
#define IMXRT_FLEXPWM1_SM1CTRL2              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CTRL2_OFFSET)      /* FLEXPWM1 Control 2 Register */
#define IMXRT_FLEXPWM1_SM1CTRL               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CTRL_OFFSET)       /* FLEXPWM1 Control Register */
#define IMXRT_FLEXPWM1_SM1VAL0               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1VAL0_OFFSET)       /* FLEXPWM1 Value Register 0 */
#define IMXRT_FLEXPWM1_SM1FRACVAL1           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1FRACVAL1_OFFSET)   /* FLEXPWM1 Fractional Value Register 1 */
#define IMXRT_FLEXPWM1_SM1VAL1               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1VAL1_OFFSET)       /* FLEXPWM1 Value Register 1 */
#define IMXRT_FLEXPWM1_SM1FRACVAL2           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1FRACVAL2_OFFSET)   /* FLEXPWM1 Fractional Value Register 2 */
#define IMXRT_FLEXPWM1_SM1VAL2               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1VAL2_OFFSET)       /* FLEXPWM1 Value Register 2 */
#define IMXRT_FLEXPWM1_SM1FRACVAL3           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1FRACVAL3_OFFSET)   /* FLEXPWM1 Fractional Value Register 3 */
#define IMXRT_FLEXPWM1_SM1VAL3               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1VAL3_OFFSET)       /* FLEXPWM1 Value Register 3 */
#define IMXRT_FLEXPWM1_SM1FRACVAL4           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1FRACVAL4_OFFSET)   /* FLEXPWM1 Fractional Value Register 4 */
#define IMXRT_FLEXPWM1_SM1VAL4               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1VAL4_OFFSET)       /* FLEXPWM1 Value Register 4 */
#define IMXRT_FLEXPWM1_SM1FRACVAL5           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1FRACVAL5_OFFSET)   /* FLEXPWM1 Fractional Value Register 5 */
#define IMXRT_FLEXPWM1_SM1VAL5               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1VAL5_OFFSET)       /* FLEXPWM1 Value Register 5 */
#define IMXRT_FLEXPWM1_SM1FRCTRL             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1FRCTRL_OFFSET)     /* FLEXPWM1 Fractional Control Register */
#define IMXRT_FLEXPWM1_SM1OCTRL              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1OCTRL_OFFSET)      /* FLEXPWM1 Output Control Register */
#define IMXRT_FLEXPWM1_SM1STS                (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1STS_OFFSET)        /* FLEXPWM1 Status Register */
#define IMXRT_FLEXPWM1_SM1INTEN              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1INTEN_OFFSET)      /* FLEXPWM1 Interrupt Enable Register */
#define IMXRT_FLEXPWM1_SM1DMAEN              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1DMAEN_OFFSET)      /* FLEXPWM1 DMA Enable Register */
#define IMXRT_FLEXPWM1_SM1TCTRL              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1TCTRL_OFFSET)      /* FLEXPWM1 Output Trigger Control Register */
#define IMXRT_FLEXPWM1_SM1DISMAP0            (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1DISMAP0_OFFSET)    /* FLEXPWM1 Fault Disable Mapping Register 0 */
#define IMXRT_FLEXPWM1_SM1DISMAP1            (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1DISMAP1_OFFSET)    /* FLEXPWM1 Fault Disable Mapping Register 1 */
#define IMXRT_FLEXPWM1_SM1DTCNT0             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1DTCNT0_OFFSET)     /* FLEXPWM1 Deadtime Count Register 0 */
#define IMXRT_FLEXPWM1_SM1DTCNT1             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1DTCNT1_OFFSET)     /* FLEXPWM1 Deadtime Count Register 1 */
#define IMXRT_FLEXPWM1_SM1CAPTCTRLA          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CAPTCTRLA_OFFSET)  /* FLEXPWM1 Capture Control A Register */
#define IMXRT_FLEXPWM1_SM1CAPTCOMPA          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CAPTCOMPA_OFFSET)  /* FLEXPWM1 Capture Compare A Register */
#define IMXRT_FLEXPWM1_eFlexPWM              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_eFlexPWM_OFFSET)      /* FLEXPWM1 apter 28 Enhanced Flex Pulse Width Modulator */
#define IMXRT_FLEXPWM1_SM1CAPTCTRLB          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CAPTCTRLB_OFFSET)  /* FLEXPWM1 Capture Control B Register */
#define IMXRT_FLEXPWM1_SM1CAPTCOMPB          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CAPTCOMPB_OFFSET)  /* FLEXPWM1 Capture Compare B Register */
#define IMXRT_FLEXPWM1_SM1CAPTCTRLX          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CAPTCTRLX_OFFSET)  /* FLEXPWM1 Capture Control X Register */
#define IMXRT_FLEXPWM1_SM1CAPTCOMPX          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CAPTCOMPX_OFFSET)  /* FLEXPWM1 Capture Compare X Register */
#define IMXRT_FLEXPWM1_SM1CVAL0              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL0_OFFSET)      /* FLEXPWM1 Capture Value 0 Register */
#define IMXRT_FLEXPWM1_SM1CVAL0CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL0CYC_OFFSET)   /* FLEXPWM1 Capture Value 0 Cycle Register */
#define IMXRT_FLEXPWM1_SM1CVAL1              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL1_OFFSET)      /* FLEXPWM1 Capture Value 1 Register */
#define IMXRT_FLEXPWM1_SM1CVAL1CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL1CYC_OFFSET)   /* FLEXPWM1 Capture Value 1 Cycle Register */
#define IMXRT_FLEXPWM1_SM1CVAL2              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL2_OFFSET)      /* FLEXPWM1 Capture Value 2 Register */
#define IMXRT_FLEXPWM1_SM1CVAL2CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL2CYC_OFFSET)   /* FLEXPWM1 Capture Value 2 Cycle Register */
#define IMXRT_FLEXPWM1_SM1CVAL3              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL3_OFFSET)      /* FLEXPWM1 Capture Value 3 Register */
#define IMXRT_FLEXPWM1_SM1CVAL3CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL3CYC_OFFSET)   /* FLEXPWM1 Capture Value 3 Cycle Register */
#define IMXRT_FLEXPWM1_SM1CVAL4              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL4_OFFSET)      /* FLEXPWM1 Capture Value 4 Register */
#define IMXRT_FLEXPWM1_SM1CVAL4CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL4CYC_OFFSET)   /* FLEXPWM1 Capture Value 4 Cycle Register */
#define IMXRT_FLEXPWM1_SM1CVAL5              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL5_OFFSET)      /* FLEXPWM1 Capture Value 5 Register */
#define IMXRT_FLEXPWM1_SM1CVAL5CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM1CVAL5CYC_OFFSET)   /* FLEXPWM1 Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM1_SM2CNT                (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CNT_OFFSET)        /* FLEXPWM1 Counter Register */
#define IMXRT_FLEXPWM1_SM2INIT               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2INIT_OFFSET)       /* FLEXPWM1 Initial Count Register */
#define IMXRT_FLEXPWM1_SM2CTRL2              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CTRL2_OFFSET)      /* FLEXPWM1 Control 2 Register */
#define IMXRT_FLEXPWM1_SM2CTRL               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CTRL_OFFSET)       /* FLEXPWM1 Control Register */
#define IMXRT_FLEXPWM1_SM2VAL0               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2VAL0_OFFSET)       /* FLEXPWM1 Value Register 0 */
#define IMXRT_FLEXPWM1_SM2FRACVAL1           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2FRACVAL1_OFFSET)   /* FLEXPWM1 Fractional Value Register 1 */
#define IMXRT_FLEXPWM1_SM2VAL1               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2VAL1_OFFSET)       /* FLEXPWM1 Value Register 1 */
#define IMXRT_FLEXPWM1_SM2FRACVAL2           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2FRACVAL2_OFFSET)   /* FLEXPWM1 Fractional Value Register 2 */
#define IMXRT_FLEXPWM1_SM2VAL2               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2VAL2_OFFSET)       /* FLEXPWM1 Value Register 2 */
#define IMXRT_FLEXPWM1_SM2FRACVAL3           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2FRACVAL3_OFFSET)   /* FLEXPWM1 Fractional Value Register 3 */
#define IMXRT_FLEXPWM1_SM2VAL3               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2VAL3_OFFSET)       /* FLEXPWM1 Value Register 3 */
#define IMXRT_FLEXPWM1_SM2FRACVAL4           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2FRACVAL4_OFFSET)   /* FLEXPWM1 Fractional Value Register 4 */
#define IMXRT_FLEXPWM1_SM2VAL4               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2VAL4_OFFSET)       /* FLEXPWM1 Value Register 4 */
#define IMXRT_FLEXPWM1_SM2FRACVAL5           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2FRACVAL5_OFFSET)   /* FLEXPWM1 Fractional Value Register 5 */
#define IMXRT_FLEXPWM1_SM2VAL5               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2VAL5_OFFSET)       /* FLEXPWM1 Value Register 5 */
#define IMXRT_FLEXPWM1_SM2FRCTRL             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2FRCTRL_OFFSET)     /* FLEXPWM1 Fractional Control Register */
#define IMXRT_FLEXPWM1_SM2OCTRL              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2OCTRL_OFFSET)      /* FLEXPWM1 Output Control Register */
#define IMXRT_FLEXPWM1_SM2STS                (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2STS_OFFSET)        /* FLEXPWM1 Status Register */
#define IMXRT_FLEXPWM1_SM2INTEN              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2INTEN_OFFSET)      /* FLEXPWM1 Interrupt Enable Register */
#define IMXRT_FLEXPWM1_SM2DMAEN              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2DMAEN_OFFSET)      /* FLEXPWM1 DMA Enable Register */
#define IMXRT_FLEXPWM1_SM2TCTRL              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2TCTRL_OFFSET)      /* FLEXPWM1 Output Trigger Control Register */
#define IMXRT_FLEXPWM1_SM2DISMAP0            (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2DISMAP0_OFFSET)    /* FLEXPWM1 Fault Disable Mapping Register 0 */
#define IMXRT_FLEXPWM1_SM2DISMAP1            (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2DISMAP1_OFFSET)    /* FLEXPWM1 Fault Disable Mapping Register 1 */
#define IMXRT_FLEXPWM1_SM2DTCNT0             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2DTCNT0_OFFSET)     /* FLEXPWM1 Deadtime Count Register 0 */
#define IMXRT_FLEXPWM1_SM2DTCNT1             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2DTCNT1_OFFSET)     /* FLEXPWM1 Deadtime Count Register 1 */
#define IMXRT_FLEXPWM1_SM2CAPTCTRLA          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CAPTCTRLA_OFFSET)  /* FLEXPWM1 Capture Control A Register */
#define IMXRT_FLEXPWM1_SM2CAPTCOMPA          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CAPTCOMPA_OFFSET)  /* FLEXPWM1 Capture Compare A Register */
#define IMXRT_FLEXPWM1_SM2CAPTCTRLB          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CAPTCTRLB_OFFSET)  /* FLEXPWM1 Capture Control B Register */
#define IMXRT_FLEXPWM1_SM2CAPTCOMPB          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CAPTCOMPB_OFFSET)  /* FLEXPWM1 Capture Compare B Register */
#define IMXRT_FLEXPWM1_SM2CAPTCTRLX          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CAPTCTRLX_OFFSET)  /* FLEXPWM1 Capture Control X Register */
#define IMXRT_FLEXPWM1_SM2CAPTCOMPX          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CAPTCOMPX_OFFSET)  /* FLEXPWM1 Capture Compare X Register */
#define IMXRT_FLEXPWM1_SM2CVAL0              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL0_OFFSET)      /* FLEXPWM1 Capture Value 0 Register */
#define IMXRT_FLEXPWM1_SM2CVAL0CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL0CYC_OFFSET)   /* FLEXPWM1 Capture Value 0 Cycle Register */
#define IMXRT_FLEXPWM1_SM2CVAL1              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL1_OFFSET)      /* FLEXPWM1 Capture Value 1 Register */
#define IMXRT_FLEXPWM1_SM2CVAL1CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL1CYC_OFFSET)   /* FLEXPWM1 Capture Value 1 Cycle Register */
#define IMXRT_FLEXPWM1_SM2CVAL2              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL2_OFFSET)      /* FLEXPWM1 Capture Value 2 Register */
#define IMXRT_FLEXPWM1_SM2CVAL2CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL2CYC_OFFSET)   /* FLEXPWM1 Capture Value 2 Cycle Register */
#define IMXRT_FLEXPWM1_SM2CVAL3              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL3_OFFSET)      /* FLEXPWM1 Capture Value 3 Register */
#define IMXRT_FLEXPWM1_SM2CVAL3CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL3CYC_OFFSET)   /* FLEXPWM1 Capture Value 3 Cycle Register */
#define IMXRT_FLEXPWM1_SM2CVAL4              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL4_OFFSET)      /* FLEXPWM1 Capture Value 4 Register */
#define IMXRT_FLEXPWM1_SM2CVAL4CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL4CYC_OFFSET)   /* FLEXPWM1 Capture Value 4 Cycle Register */
#define IMXRT_FLEXPWM1_SM2CVAL5              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL5_OFFSET)      /* FLEXPWM1 Capture Value 5 Register */
#define IMXRT_FLEXPWM1_SM2CVAL5CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM2CVAL5CYC_OFFSET)   /* FLEXPWM1 Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM1_SM3CNT                (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CNT_OFFSET)        /* FLEXPWM1 Counter Register */
#define IMXRT_FLEXPWM1_SM3INIT               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3INIT_OFFSET)       /* FLEXPWM1 Initial Count Register */
#define IMXRT_FLEXPWM1_SM3CTRL2              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CTRL2_OFFSET)      /* FLEXPWM1 Control 2 Register */
#define IMXRT_FLEXPWM1_SM3CTRL               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CTRL_OFFSET)       /* FLEXPWM1 Control Register */
#define IMXRT_FLEXPWM1_SM3VAL0               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3VAL0_OFFSET)       /* FLEXPWM1 Value Register 0 */
#define IMXRT_FLEXPWM1_SM3FRACVAL1           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3FRACVAL1_OFFSET)   /* FLEXPWM1 Fractional Value Register 1 */
#define IMXRT_FLEXPWM1_SM3VAL1               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3VAL1_OFFSET)       /* FLEXPWM1 Value Register 1 */
#define IMXRT_FLEXPWM1_SM3FRACVAL2           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3FRACVAL2_OFFSET)   /* FLEXPWM1 Fractional Value Register 2 */
#define IMXRT_FLEXPWM1_SM3VAL2               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3VAL2_OFFSET)       /* FLEXPWM1 Value Register 2 */
#define IMXRT_FLEXPWM1_SM3FRACVAL3           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3FRACVAL3_OFFSET)   /* FLEXPWM1 Fractional Value Register 3 */
#define IMXRT_FLEXPWM1_SM3VAL3               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3VAL3_OFFSET)       /* FLEXPWM1 Value Register 3 */
#define IMXRT_FLEXPWM1_SM3FRACVAL4           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3FRACVAL4_OFFSET)   /* FLEXPWM1 Fractional Value Register 4 */
#define IMXRT_FLEXPWM1_SM3VAL4               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3VAL4_OFFSET)       /* FLEXPWM1 Value Register 4 */
#define IMXRT_FLEXPWM1_SM3FRACVAL5           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3FRACVAL5_OFFSET)   /* FLEXPWM1 Fractional Value Register 5 */
#define IMXRT_FLEXPWM1_SM3VAL5               (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3VAL5_OFFSET)       /* FLEXPWM1 Value Register 5 */
#define IMXRT_FLEXPWM1_SM3FRCTRL             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3FRCTRL_OFFSET)     /* FLEXPWM1 Fractional Control Register */
#define IMXRT_FLEXPWM1_SM3OCTRL              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3OCTRL_OFFSET)      /* FLEXPWM1 Output Control Register */
#define IMXRT_FLEXPWM1_SM3STS                (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3STS_OFFSET)        /* FLEXPWM1 Status Register */
#define IMXRT_FLEXPWM1_SM3INTEN              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3INTEN_OFFSET)      /* FLEXPWM1 Interrupt Enable Register */
#define IMXRT_FLEXPWM1_SM3DMAEN              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3DMAEN_OFFSET)      /* FLEXPWM1 DMA Enable Register */
#define IMXRT_FLEXPWM1_SM3TCTRL              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3TCTRL_OFFSET)      /* FLEXPWM1 Output Trigger Control Register */
#define IMXRT_FLEXPWM1_SM3DISMAP0            (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3DISMAP0_OFFSET)    /* FLEXPWM1 Fault Disable Mapping Register 0 */
#define IMXRT_FLEXPWM1_SM3DISMAP1            (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3DISMAP1_OFFSET)    /* FLEXPWM1 Fault Disable Mapping Register 1 */
#define IMXRT_FLEXPWM1_SM3DTCNT0             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3DTCNT0_OFFSET)     /* FLEXPWM1 Deadtime Count Register 0 */
#define IMXRT_FLEXPWM1_SM3DTCNT1             (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3DTCNT1_OFFSET)     /* FLEXPWM1 Deadtime Count Register 1 */
#define IMXRT_FLEXPWM1_SM3CAPTCTRLA          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CAPTCTRLA_OFFSET)  /* FLEXPWM1 Capture Control A Register */
#define IMXRT_FLEXPWM1_SM3CAPTCOMPA          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CAPTCOMPA_OFFSET)  /* FLEXPWM1 Capture Compare A Register */
#define IMXRT_FLEXPWM1_SM3CAPTCTRLB          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CAPTCTRLB_OFFSET)  /* FLEXPWM1 Capture Control B Register */
#define IMXRT_FLEXPWM1_SM3CAPTCOMPB          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CAPTCOMPB_OFFSET)  /* FLEXPWM1 Capture Compare B Register */
#define IMXRT_FLEXPWM1_SM3CAPTCTRLX          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CAPTCTRLX_OFFSET)  /* FLEXPWM1 Capture Control X Register */
#define IMXRT_FLEXPWM1_SM3CAPTCOMPX          (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CAPTCOMPX_OFFSET)  /* FLEXPWM1 Capture Compare X Register */
#define IMXRT_FLEXPWM1_SM3CVAL0              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CVAL0_OFFSET)      /* FLEXPWM1 Capture Value 0 Register */
#define IMXRT_FLEXPWM1_SM3CVAL0CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CVAL0CYC_OFFSET)   /* FLEXPWM1 Capture Value 0 Cycle Register */
#define IMXRT_FLEXPWM1_SM3CVAL1              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CVAL1_OFFSET)      /* FLEXPWM1 Capture Value 1 Register */
#define IMXRT_FLEXPWM1_SM3CVAL1CYC           (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CVAL1CYC_OFFSET)   /* FLEXPWM1 Capture Value 1 Cycle Register */
#define IMXRT_FLEXPWM1_SM3CVAL2              (IMXRT_FLEXPWM1_BASE + IMXRT_FLEXPWM_SM3CVAL2_OFFSET)      /* FLEXPWM1 Capture Value 2 Register */
