apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
#define IMXRT_FLEXPWM3_SM2CVAL5CYC           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM2CVAL5CYC_OFFSET)   /* FLEXPWM3 Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM3_SM3CNT                (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CNT_OFFSET)        /* FLEXPWM3 Counter Register */
#define IMXRT_FLEXPWM3_SM3INIT               (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3INIT_OFFSET)       /* FLEXPWM3 Initial Count Register */
#define IMXRT_FLEXPWM3_SM3CTRL2              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CTRL2_OFFSET)      /* FLEXPWM3 Control 2 Register */
#define IMXRT_FLEXPWM3_SM3CTRL               (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CTRL_OFFSET)       /* FLEXPWM3 Control Register */
#define IMXRT_FLEXPWM3_SM3VAL0               (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3VAL0_OFFSET)       /* FLEXPWM3 Value Register 0 */
#define IMXRT_FLEXPWM3_SM3FRACVAL1           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3FRACVAL1_OFFSET)   /* FLEXPWM3 Fractional Value Register 1 */
#define IMXRT_FLEXPWM3_SM3VAL1               (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3VAL1_OFFSET)       /* FLEXPWM3 Value Register 1 */
#define IMXRT_FLEXPWM3_SM3FRACVAL2           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3FRACVAL2_OFFSET)   /* FLEXPWM3 Fractional Value Register 2 */
#define IMXRT_FLEXPWM3_SM3VAL2               (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3VAL2_OFFSET)       /* FLEXPWM3 Value Register 2 */
#define IMXRT_FLEXPWM3_SM3FRACVAL3           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3FRACVAL3_OFFSET)   /* FLEXPWM3 Fractional Value Register 3 */
#define IMXRT_FLEXPWM3_SM3VAL3               (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3VAL3_OFFSET)       /* FLEXPWM3 Value Register 3 */
#define IMXRT_FLEXPWM3_SM3FRACVAL4           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3FRACVAL4_OFFSET)   /* FLEXPWM3 Fractional Value Register 4 */
#define IMXRT_FLEXPWM3_SM3VAL4               (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3VAL4_OFFSET)       /* FLEXPWM3 Value Register 4 */
#define IMXRT_FLEXPWM3_SM3FRACVAL5           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3FRACVAL5_OFFSET)   /* FLEXPWM3 Fractional Value Register 5 */
#define IMXRT_FLEXPWM3_SM3VAL5               (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3VAL5_OFFSET)       /* FLEXPWM3 Value Register 5 */
#define IMXRT_FLEXPWM3_SM3FRCTRL             (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3FRCTRL_OFFSET)     /* FLEXPWM3 Fractional Control Register */
#define IMXRT_FLEXPWM3_SM3OCTRL              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3OCTRL_OFFSET)      /* FLEXPWM3 Output Control Register */
#define IMXRT_FLEXPWM3_SM3STS                (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3STS_OFFSET)        /* FLEXPWM3 Status Register */
#define IMXRT_FLEXPWM3_SM3INTEN              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3INTEN_OFFSET)      /* FLEXPWM3 Interrupt Enable Register */
#define IMXRT_FLEXPWM3_SM3DMAEN              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3DMAEN_OFFSET)      /* FLEXPWM3 DMA Enable Register */
#define IMXRT_FLEXPWM3_SM3TCTRL              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3TCTRL_OFFSET)      /* FLEXPWM3 Output Trigger Control Register */
#define IMXRT_FLEXPWM3_SM3DISMAP0            (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3DISMAP0_OFFSET)    /* FLEXPWM3 Fault Disable Mapping Register 0 */
#define IMXRT_FLEXPWM3_SM3DISMAP1            (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3DISMAP1_OFFSET)    /* FLEXPWM3 Fault Disable Mapping Register 1 */
#define IMXRT_FLEXPWM3_SM3DTCNT0             (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3DTCNT0_OFFSET)     /* FLEXPWM3 Deadtime Count Register 0 */
#define IMXRT_FLEXPWM3_SM3DTCNT1             (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3DTCNT1_OFFSET)     /* FLEXPWM3 Deadtime Count Register 1 */
#define IMXRT_FLEXPWM3_SM3CAPTCTRLA          (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CAPTCTRLA_OFFSET)  /* FLEXPWM3 Capture Control A Register */
#define IMXRT_FLEXPWM3_SM3CAPTCOMPA          (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CAPTCOMPA_OFFSET)  /* FLEXPWM3 Capture Compare A Register */
#define IMXRT_FLEXPWM3_SM3CAPTCTRLB          (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CAPTCTRLB_OFFSET)  /* FLEXPWM3 Capture Control B Register */
#define IMXRT_FLEXPWM3_SM3CAPTCOMPB          (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CAPTCOMPB_OFFSET)  /* FLEXPWM3 Capture Compare B Register */
#define IMXRT_FLEXPWM3_SM3CAPTCTRLX          (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CAPTCTRLX_OFFSET)  /* FLEXPWM3 Capture Control X Register */
#define IMXRT_FLEXPWM3_SM3CAPTCOMPX          (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CAPTCOMPX_OFFSET)  /* FLEXPWM3 Capture Compare X Register */
#define IMXRT_FLEXPWM3_SM3CVAL0              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL0_OFFSET)      /* FLEXPWM3 Capture Value 0 Register */
#define IMXRT_FLEXPWM3_SM3CVAL0CYC           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL0CYC_OFFSET)   /* FLEXPWM3 Capture Value 0 Cycle Register */
#define IMXRT_FLEXPWM3_SM3CVAL1              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL1_OFFSET)      /* FLEXPWM3 Capture Value 1 Register */
#define IMXRT_FLEXPWM3_SM3CVAL1CYC           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL1CYC_OFFSET)   /* FLEXPWM3 Capture Value 1 Cycle Register */
#define IMXRT_FLEXPWM3_SM3CVAL2              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL2_OFFSET)      /* FLEXPWM3 Capture Value 2 Register */
#define IMXRT_FLEXPWM3_SM3CVAL2CYC           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL2CYC_OFFSET)   /* FLEXPWM3 Capture Value 2 Cycle Register */
#define IMXRT_FLEXPWM3_SM3CVAL3              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL3_OFFSET)      /* FLEXPWM3 Capture Value 3 Register */
#define IMXRT_FLEXPWM3_SM3CVAL3CYC           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL3CYC_OFFSET)   /* FLEXPWM3 Capture Value 3 Cycle Register */
#define IMXRT_FLEXPWM3_SM3CVAL4              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL4_OFFSET)      /* FLEXPWM3 Capture Value 4 Register */
#define IMXRT_FLEXPWM3_SM3CVAL4CYC           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL4CYC_OFFSET)   /* FLEXPWM3 Capture Value 4 Cycle Register */
#define IMXRT_FLEXPWM3_SM3CVAL5              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL5_OFFSET)      /* FLEXPWM3 Capture Value 5 Register */
#define IMXRT_FLEXPWM3_SM3CVAL5CYC           (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SM3CVAL5CYC_OFFSET)   /* FLEXPWM3 Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM3_OUTEN                 (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_OUTEN_OFFSET)         /* FLEXPWM3 Output Enable Register */
#define IMXRT_FLEXPWM3_MASK                  (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_MASK_OFFSET)          /* FLEXPWM3 Mask Register */
#define IMXRT_FLEXPWM3_SWCOUT                (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_SWCOUT_OFFSET)        /* FLEXPWM3 Software Controlled Output Register */
#define IMXRT_FLEXPWM3_DTSRCSEL              (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_DTSRCSEL_OFFSET)      /* FLEXPWM3 PWM Source Select Register */
#define IMXRT_FLEXPWM3_MCTRL                 (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_MCTRL_OFFSET)         /* FLEXPWM3 Master Control Register */
#define IMXRT_FLEXPWM3_MCTRL2                (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_MCTRL2_OFFSET)        /* FLEXPWM3 Master Control 2 Register */
#define IMXRT_FLEXPWM3_FCTRL0                (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_FCTRL0_OFFSET)        /* FLEXPWM3 Fault Control Register */
#define IMXRT_FLEXPWM3_FSTS0                 (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_FSTS0_OFFSET)         /* FLEXPWM3 Fault Status Register */
#define IMXRT_FLEXPWM3_FFILT0                (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_FFILT0_OFFSET)        /* FLEXPWM3 Fault Filter Register */
#define IMXRT_FLEXPWM3_FTST0                 (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_FTST0_OFFSET)         /* FLEXPWM3 Fault Test Register */
#define IMXRT_FLEXPWM3_FCTRL20               (IMXRT_FLEXPWM3_BASE + IMXRT_FLEXPWM_FCTRL20_OFFSET)       /* FLEXPWM3 Fault Control 2 Register */

/* FLEXPWM4 Register Addresses */

