apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
#define IMXRT_FLEXPWM4_SM3CVAL2CYC           (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_SM3CVAL2CYC_OFFSET)   /* FLEXPWM4 Capture Value 2 Cycle Register */
#define IMXRT_FLEXPWM4_SM3CVAL3              (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_SM3CVAL3_OFFSET)      /* FLEXPWM4 Capture Value 3 Register */
#define IMXRT_FLEXPWM4_SM3CVAL3CYC           (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_SM3CVAL3CYC_OFFSET)   /* FLEXPWM4 Capture Value 3 Cycle Register */
#define IMXRT_FLEXPWM4_SM3CVAL4              (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_SM3CVAL4_OFFSET)      /* FLEXPWM4 Capture Value 4 Register */
#define IMXRT_FLEXPWM4_SM3CVAL4CYC           (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_SM3CVAL4CYC_OFFSET)   /* FLEXPWM4 Capture Value 4 Cycle Register */
#define IMXRT_FLEXPWM4_SM3CVAL5              (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_SM3CVAL5_OFFSET)      /* FLEXPWM4 Capture Value 5 Register */
#define IMXRT_FLEXPWM4_SM3CVAL5CYC           (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_SM3CVAL5CYC_OFFSET)   /* FLEXPWM4 Capture Value 5 Cycle Register */
#define IMXRT_FLEXPWM4_OUTEN                 (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_OUTEN_OFFSET)         /* FLEXPWM4 Output Enable Register */
#define IMXRT_FLEXPWM4_MASK                  (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_MASK_OFFSET)          /* FLEXPWM4 Mask Register */
#define IMXRT_FLEXPWM4_SWCOUT                (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_SWCOUT_OFFSET)        /* FLEXPWM4 Software Controlled Output Register */
#define IMXRT_FLEXPWM4_DTSRCSEL              (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_DTSRCSEL_OFFSET)      /* FLEXPWM4 PWM Source Select Register */
#define IMXRT_FLEXPWM4_MCTRL                 (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_MCTRL_OFFSET)         /* FLEXPWM4 Master Control Register */
#define IMXRT_FLEXPWM4_MCTRL2                (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_MCTRL2_OFFSET)        /* FLEXPWM4 Master Control 2 Register */
#define IMXRT_FLEXPWM4_FCTRL0                (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_FCTRL0_OFFSET)        /* FLEXPWM4 Fault Control Register */
#define IMXRT_FLEXPWM4_FSTS0                 (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_FSTS0_OFFSET)         /* FLEXPWM4 Fault Status Register */
#define IMXRT_FLEXPWM4_FFILT0                (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_FFILT0_OFFSET)        /* FLEXPWM4 Fault Filter Register */
#define IMXRT_FLEXPWM4_FTST0                 (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_FTST0_OFFSET)         /* FLEXPWM4 Fault Test Register */
#define IMXRT_FLEXPWM4_FCTRL20               (IMXRT_FLEXPWM4_BASE + IMXRT_FLEXPWM_FCTRL20_OFFSET)       /* FLEXPWM4 Fault Control 2 Register */

/* Register Bit Definitions *********************************************************
 *
 *   A single FLEXPWM[n] module (where n is 1..4) has submodules 0 - 3
 * FLEXPWM module Base addresses are spaced every 0x4000 bytes starting at
 * IMXRT_FLEXPWM1_BASE. Therefore each PWM has A0-A3 and B0-B3 outputs.
 * The is 8 outputs per FLEXPWM module.
 *
 *   Each submodule instance is 0x60 bytes.
 *
 *   The address of a register is the sum of a base address and an address offset.
 * The base address is defined as the module IMXRT_FLEXPWMn_BASE (n=1..4), and
 * the address offset is defined at the module level. Each PWM module has a set
 * of registers for each PWM submodule, for the configuration logic, and
 * for each fault channel. While the registers are 16-bits wide, they can be
 * accessed in pairs as 32-bit registers.
 *
 *   Submodule registers are repeated for each PWM submodule. To designate which
 * submodule they are in, register names are prefixed with SM0, SM1, SM2, and SM3
 * Since all these register definitions are identical the defines herein drops the
 * number 0-3 from the prefix.
 *
 *   For example the 'Status Register' appears 4 times per moulde
 * (IMXRT_FLEXPWMn_BASE) as IMXRT_FLEXPWM_SM0STS_OFFSET, IMXRT_FLEXPWM_SM1STS_OFFSET,
 * IMXRT_FLEXPWM_SM2STS_OFFSET and IMXRT_FLEXPWM_SM3STS_OFFSET. But the bit
 * definitions for the  'Status Register' are defined as SMSTS_xxxxx (with the number
 * dropped.
 *
 *   The base address of submodule 0 is the same as the base address for the PWM module as a
 * whole. The base address of submodule 1 is offset 0x60 from the base address for the PWM
 * module as a whole. This 0x60 offset is based on the number of registers in a submodule.
 * The base address of submodule 2 is equal to the base address of submodule 1 plus this
 * same 0x60 offset. The pattern repeats for the base address of submodule 3
 * .
 *   The base address of the module configuration registers is equal to the base address
 * of the PWM module as a whole plus an offset of 0x180.
 *
 *   Fault channel registers are repeated for each fault channel. To designate which fault
 * channel they are in, register names are prefixed with F0 and F1. The base address of fault
 * channel 0 is equal to the base address of the PWM module as a whole plus an offset of
 * 0x18C. The base address of fault channel 1 is the base address of fault channel 0 + 4.
 * This 4 offset is based on the number of registers in a fault channel. Each of the four
 * fields in the fault channel registers corresponds to fault inputs 3-0.
 */

/* Control 2 Register */

#define SMCTRL2_CLK_SEL_SHIFT                (0)        /* Bits: 0-1  Clock Source Select */
#define SMCTRL2_CLK_SEL_MASK                 (3 << SMCTRL2_CLK_SEL_SHIFT)
#  define SMCTRL2_CLK_SEL(n)                 ((uint32_t)(n) << SMCTRL2_CLK_SEL_SHIFT)
#  define SMCTRL2_CLK_SEL_IPG_CLK            (0 << SMCTRL2_CLK_SEL_SHIFT)  /* The IPBus clock is used as the clock for the local prescaler and counter. */
#  define SMCTRL2_CLK_SEL_EXT_CLK            (1 << SMCTRL2_CLK_SEL_SHIFT)  /* EXT_CLK is used as the clock for the local prescaler and counter. */
#  define SMCTRL2_CLK_SEL_AUX_CLK            (2 << SMCTRL2_CLK_SEL_SHIFT)  /* Submodule 0’s clock (AUX_CLK) is used as the source clock for the local prescaler and counter. */
#define SMCTRL2_RELOAD_SEL                   (1 << 2)   /* Bit: 2  Reload Source Select */
#  define SMCTRL2_RELOAD_SEL_LOCAL           (0 << 2)   /* Reload Source is local */
#  define SMCTRL2_RELOAD_SEL_SM0             (1 << 2)   /* Reload Source is submodule 0 */
#define SMCTRL2_FORCE_SEL_SHIFT              (3)        /* Bits: 3-5  This read/write bit determines the source of the FORCE OUTPUT signal for this submodule. */
#define SMCTRL2_FORCE_SEL_MASK               (7 << SMCTRL2_FORCE_SEL_SHIFT)
#  define SMCTRL2_FORCE_SEL(n)               ((uint32_t)(n) << SMCTRL2_FORCE_SEL_SHIFT)
#  define SMCTRL2_FORCE_SEL_CTRL2_FORCE      (0 << SMCTRL2_FORCE_SEL_SHIFT)  /* The local force signal, CTRL2[FORCE], from this submodule is used to force updates. */
#  define SMCTRL2_FORCE_SEL_SM0              (1 << SMCTRL2_FORCE_SEL_SHIFT)  /* The master force signal from submodule 0 is used to force updates. */
#  define SMCTRL2_FORCE_SEL_LOCAL            (2 << SMCTRL2_FORCE_SEL_SHIFT)  /* The local reload signal from this submodule is used to force updates without regard to the state of LDOK. */
#  define SMCTRL2_FORCE_SEL_SM0_LDOK         (3 << SMCTRL2_FORCE_SEL_SHIFT)  /* The master reload signal from submodule0 is used to force updates if LDOK is set.  */
#  define SMCTRL2_FORCE_SEL_LOCAL_SYNC       (4 << SMCTRL2_FORCE_SEL_SHIFT)  /* The local sync signal from this submodule is used to force updates. */
#  define SMCTRL2_FORCE_SEL_SM0_SYNC         (5 << SMCTRL2_FORCE_SEL_SHIFT)  /* The master sync signal from submodule0 is used to force updates. */
#  define SMCTRL2_FORCE_SEL_EXT_FORCE        (6 << SMCTRL2_FORCE_SEL_SHIFT)  /* The external force signal, EXT_FORCE, from outside the PWM module causes updates. */
#  define SMCTRL2_FORCE_SEL_EXT_SYNC         (7 << SMCTRL2_FORCE_SEL_SHIFT)  /* The external sync signal, EXT_SYNC, from outside the PWM module causes updates */
#define SMCTRL2_FORCE                        (1 << 6)   /* Bit: 6  Force Initialization */
#define SMCTRL2_FRCEN                        (1 << 7)   /* Bit: 7  FRCEN */
#define SMCTRL2_INIT_SEL_SHIFT               (8)        /* Bits: 8-9  Initialization Control Select */
#define SMCTRL2_INIT_SEL_MASK                (3 << SMCTRL2_INIT_SEL_SHIFT)
#  define SMCTRL2_INIT_SEL(n)                ((uint32_t)(n) << SMCTRL2_INIT_SEL_SHIFT)
#  define SMCTRL2_INIT_SEL_LOCAL             (0 << SMCTRL2_INIT_SEL_SHIFT)  /* Local sync (PWM_X) causes initialization. */
#  define SMCTRL2_INIT_SEL_SM0               (1 << SMCTRL2_INIT_SEL_SHIFT)  /* Master reload from submodule 0 causes initialization. */
#  define SMCTRL2_INIT_SEL_SM0_SYNC          (2 << SMCTRL2_INIT_SEL_SHIFT)  /* Master sync from submodule 0 causes initialization. */
#  define SMCTRL2_INIT_SEL_EXT_SYNC          (3 << SMCTRL2_INIT_SEL_SHIFT)  /* EXT_SYNC causes initialization. */
#define SMCTRL2_PWMX_INIT                    (1 << 10)  /* Bit: 10 PWM_X Initial Value */
#define SMCTRL2_PWM45_INIT                   (1 << 11)  /* Bit: 11 PWM45 Initial Value */
#define SMCTRL2_PWM23_INIT                   (1 << 12)  /* Bit: 12 PWM23 Initial Value */
#define SMCTRL2_INDEP                        (1 << 13)  /* Bit: 13 Independent or Complementary Pair Operation */
#define SMCTRL2_WAITEN                       (1 << 14)  /* Bit: 14 WAIT Enable */
#define SMCTRL2_DBGEN                        (1 << 15)  /* Bit: 15 Debug Enable */

/* Control Register */

#define SMCTRL_DBLEN                         (1 << 0)   /* Bit: 0  Double Switching Enable */
#define SMCTRL_DBLX                          (1 << 1)   /* Bit: 1  PWMX Double Switching Enable */
#define SMCTRL_LDMOD                         (1 << 2)   /* Bit: 2  Load Mode Select */
#define SMCTRL_SPLIT                         (1 << 3)   /* Bit: 3  Split the DBLPWM signal to PWMA and PWMB */
#define SMCTRL_PRSC_SHIFT                    (4)        /* Bits: 4-6  Prescaler */
#define SMCTRL_PRSC_MASK                     (7 << SMCTRL_PRSC_SHIFT)
#  define SMCTRL_PRSC(n)                     ((uint32_t)(n) << SMCTRL_PRSC_SHIFT)
#  define SMCTRL_PRSC_DIV1                   (0 << SMCTRL_PRSC_SHIFT)  /* PWM clock frequency = fclk */
#  define SMCTRL_PRSC_DIV2                   (1 << SMCTRL_PRSC_SHIFT)  /* PWM clock frequency = fclk/2 */
#  define SMCTRL_PRSC_DIV4                   (2 << SMCTRL_PRSC_SHIFT)  /* PWM clock frequency = fclk/4 */
#  define SMCTRL_PRSC_DIV8                   (3 << SMCTRL_PRSC_SHIFT)  /* PWM clock frequency = fclk/8 */
#  define SMCTRL_PRSC_DIV16                  (4 << SMCTRL_PRSC_SHIFT)  /* PWM clock frequency = fclk/16 */
#  define SMCTRL_PRSC_DIV32                  (5 << SMCTRL_PRSC_SHIFT)  /* PWM clock frequency = fclk/32 */
#  define SMCTRL_PRSC_DIV64                  (6 << SMCTRL_PRSC_SHIFT)  /* PWM clock frequency = fclk/64 */
#  define SMCTRL_PRSC_DIV128                 (7 << SMCTRL_PRSC_SHIFT)  /* PWM clock frequency = fclk/128*/
#define SMCTRL_COMPMODE                      (1 << 7)   /* Bit: 7  Compare Mode */
#define SMCTRL_DT_SHIFT                      (8)        /* Bits: 8-9  Deadtime */
#define SMCTRL_DT_MASK                       (3 << SMCTRL_DT_SHIFT)
#  define SMCTRL_DT(n)                       ((uint32_t)(n) << SMCTRL_DT_SHIFT)
#  define SMCTRL_DT0                         (1 << SMCTRL_DT_SHIFT)  /* Read Only. These read only bits reflect the sampled values of the PWM_X input */
#  define SMCTRL_DT1                         (2 << SMCTRL_DT_SHIFT)  /* Sampling occurs at the end of deadtime 0 for DT[0] and the end of deadtime 1 for DT[1]. */
#define SMCTRL_FULL                          (1 << 10)  /* Bit: 10 Full Cycle Reload */
#define SMCTRL_HALF                          (1 << 11)  /* Bit: 11 Half Cycle Reload */
#define SMCTRL_LDFQ_SHIFT                    (12)       /* Bits: 12-15  Load Frequency */
#define SMCTRL_LDFQ_MASK                     (0xf << SMCTRL_LDFQ_SHIFT)
#  define SMCTRL_LDFQ(n)                     ((uint32_t)(n) << SMCTRL_LDFQ_SHIFT)
#  define SMCTRL_LDFQ_EVERY                  (0 << SMCTRL_LDFQ_SHIFT)   /* Every PWM opportunity */
#  define SMCTRL_LDFQ_EVERY2                 (1 << SMCTRL_LDFQ_SHIFT)   /* Every 2 PWM opportunities */
#  define SMCTRL_LDFQ_EVERY3                 (2 << SMCTRL_LDFQ_SHIFT)   /* Every 3 PWM opportunities */
#  define SMCTRL_LDFQ_EVERY4                 (3 << SMCTRL_LDFQ_SHIFT)   /* Every 4 PWM opportunities */
#  define SMCTRL_LDFQ_EVERY5                 (4 << SMCTRL_LDFQ_SHIFT)   /* Every 5 PWM opportunities */
#  define SMCTRL_LDFQ_EVERY6                 (5 << SMCTRL_LDFQ_SHIFT)   /* Every 6 PWM opportunities */
#  define SMCTRL_LDFQ_EVERY7                 (6 << SMCTRL_LDFQ_SHIFT)   /* Every 7 PWM opportunities */
#  define SMCTRL_LDFQ_EVERY8                 (7 << SMCTRL_LDFQ_SHIFT)   /* Every 8 PWM opportunities */
#  define SMCTRL_LDFQ_EVERY9                 (8 << SMCTRL_LDFQ_SHIFT)   /* Every 9 PWM opportunities */
#  define SMCTRL_LDFQ_EVERY10                (9 << SMCTRL_LDFQ_SHIFT)   /* Every 10 PWM opportunities */
#  define SMCTRL_LDFQ_EVERY11                (10 << SMCTRL_LDFQ_SHIFT)  /* Every 11 PWM opportunities  */
#  define SMCTRL_LDFQ_EVERY12                (11 << SMCTRL_LDFQ_SHIFT)  /* Every 12 PWM opportunities  */
#  define SMCTRL_LDFQ_EVERY13                (12 << SMCTRL_LDFQ_SHIFT)  /* Every 13 PWM opportunities  */
#  define SMCTRL_LDFQ_EVERY14                (13 << SMCTRL_LDFQ_SHIFT)  /* Every 14 PWM opportunities  */
#  define SMCTRL_LDFQ_EVERY15                (14 << SMCTRL_LDFQ_SHIFT)  /* Every 15 PWM opportunities  */
#  define SMCTRL_LDFQ_EVERY16                (0xf << SMCTRL_LDFQ_SHIFT)  /* Every 16 PWM opportunities */

/* Fractional Value Register 1 */

#define SMFRACV_FRACVAL1_SHIFT               (11)       /* Bits: 11-15  Fractional Value 1 Register */
#define SMFRACV_FRACVAL1_MASK                (0x1f << SMFRACV_FRACVAL1_SHIFT)
#  define SMFRACV_FRACVAL1(n)                ((uint32_t)(n) << SMFRACV_FRACVAL1_SHIFT)

