apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
/* Fractional Value Register 2 */

#define SMFRACV_FRACVAL2_SHIFT               (11)       /* Bits: 11-15  Fractional Value 2 Register */
#define SMFRACV_FRACVAL2_MASK                (0x1f << SMFRACV_FRACVAL2_SHIFT)
#  define SMFRACV_FRACVAL2(n)                ((uint32_t)(n) << SMFRACV_FRACVAL2_SHIFT)

/* Fractional Value Register 3 */

#define SMFRACV_FRACVAL3_SHIFT               (11)       /* Bits: 11-15  Fractional Value 3 Register */
#define SMFRACV_FRACVAL3_MASK                (0x1f << SMFRACV_FRACVAL3_SHIFT)
#  define SMFRACV_FRACVAL3(n)                ((uint32_t)(n) << SMFRACV_FRACVAL3_SHIFT)

/* Fractional Value Register 4 */

#define SMFRACV_FRACVAL4_SHIFT               (11)       /* Bits: 11-15  Fractional Value 4 Register */
#define SMFRACV_FRACVAL4_MASK                (0x1f << SMFRACV_FRACVAL4_SHIFT)
#  define SMFRACV_FRACVAL4(n)                ((uint32_t)(n) << SMFRACV_FRACVAL4_SHIFT)

/* Fractional Value Register 5 */

#define SMFRACV_FRACVAL5_SHIFT               (11)       /* Bits: 11-15  Fractional Value 5 Register */
#define SMFRACV_FRACVAL5_MASK                (0x1f << SMFRACV_FRACVAL5_SHIFT)
#  define SMFRACV_FRACVAL5(n)                ((uint32_t)(n) << SMFRACV_FRACVAL5_SHIFT)

/* Fractional Control Register */

                                                        /* Bit: 0 Reserved */
#define SMFRCTRL_FRAC1_EN                    (1 << 1)   /* Bit: 1  Fractional Cycle PWM Period Enable */
#define SMFRCTRL_FRAC45_EN                   (1 << 2)   /* Bit: 2  Fractional Cycle Placement Enable for PWM_A */
                                                        /* Bit: 3 Reserved */
#define SMFRCTRL_FRAC45_EN                   (1 << 4)   /* Bit: 4  Fractional Cycle Placement Enable for PWM_B */
                                                        /* Bits: 5-7 Reserved */
#define SMFRCTRL_FRAC_PU                     (1 << 8)   /* Bit: 8  Fractional Delay Circuit Power Up */
                                                        /* Bits: 9-15 Reserved */
#define SMFRCTRL_TEST                        (1 << 15)  /* Bit: 15 Test Status Bit */

/* Output Control Register */

#define SMOCTRL_PWMXFS_SHIFT                 (0)        /* Bits: 0-1  PWM_X Fault State */
#define SMOCTRL_PWMXFS_MASK                  (3 << SMOCTRL_PWMXFS_SHIFT)
#  define SMOCTRL_PWMXFS(n)                  ((uint32_t)(n) << SMOCTRL_PWMXFS_SHIFT)
#  define SMOCTRL_PWMXFS_0                   (0 << SMOCTRL_PWMXFS_SHIFT)  /* Output is forced to logic 0 state prior to consideration of output polarity control. */
#  define SMOCTRL_PWMXFS_1                   (1 << SMOCTRL_PWMXFS_SHIFT)  /* Output is forced to logic 1 state prior to consideration of output polarity control. */
#  define SMOCTRL_PWMXFS_TRISTATE            (2 << SMOCTRL_PWMXFS_SHIFT)  /* Output is tristated. */
#define SMOCTRL_PWMBFS_SHIFT                 (2)        /* Bits: 2-3  PWM_B Fault State */
#define SMOCTRL_PWMBFS_MASK                  (3 << SMOCTRL_PWMBFS_SHIFT)
#  define SMOCTRL_PWMBFS(n)                  ((uint32_t)(n) << SMOCTRL_PWMBFS_SHIFT)
#  define SMOCTRL_PWMBFS_0                   (0 << SMOCTRL_PWMBFS_SHIFT)  /* Output is forced to logic 0 state prior to consideration of output polarity control. */
#  define SMOCTRL_PWMBFS_1                   (1 << SMOCTRL_PWMBFS_SHIFT)  /* Output is forced to logic 1 state prior to consideration of output polarity control. */
#  define SMOCTRL_PWMBFS_TRISTATE            (2 << SMOCTRL_PWMBFS_SHIFT)  /* Output is tristated. */
#define SMOCTRL_PWMAFS_SHIFT                 (4)        /* Bits: 4-5  PWM_A Fault State */
#define SMOCTRL_PWMAFS_MASK                  (3 << SMOCTRL_PWMAFS_SHIFT)
#  define SMOCTRL_PWMAFS(n)                  ((uint32_t)(n) << SMOCTRL_PWMAFS_SHIFT)
#  define SMOCTRL_PWMAFS_0                   (0 << SMOCTRL_PWMAFS_SHIFT)  /* Output is forced to logic 0 state prior to consideration of output polarity control. */
#  define SMOCTRL_PWMAFS_1                   (1 << SMOCTRL_PWMAFS_SHIFT)  /* Output is forced to logic 1 state prior to consideration of output polarity control. */
#  define SMOCTRL_PWMAFS_TRISTATE            (2 << SMOCTRL_PWMAFS_SHIFT)  /* Output is tristated. */
                                                        /* Bits: 6-7 Reserved */
#define SMOCTRL_POLX                         (1 << 8)   /* Bit: 8  PWM_X Output Polarity */
#define SMOCTRL_POLB                         (1 << 9)   /* Bit: 9  PWM_B Output Polarity */
#define SMOCTRL_POLA                         (1 << 10)  /* Bit: 10 PWM_A Output Polarity */
                                                        /* Bits: 11-12 Reserved */
#define SMOCTRL_PWMX_IN                      (1 << 13)  /* Bit: 13 PWM_X Input */
#define SMOCTRL_PWMB_IN                      (1 << 14)  /* Bit: 14 PWM_B Input */
#define SMOCTRL_PWMA_IN                      (1 << 15)  /* Bit: 15 PWM_A Input */

/* Status Register */

#define SMSTS_CMPF_SHIFT                     (0)        /* Bits: 0-5  Compare Flags */
#define SMSTS_CMPF_MASK                      (0x3f << SMSTS_CMPF_SHIFT)
#  define SMSTS_CMPF(n)                      ((uint32_t)(n) << SMSTS_CMPF_SHIFT)
#  define SMSTS_CMPF_VAL0                    (1 << SMSTS_CMPF_SHIFT)   /* A compare event has occurred for VAL0 value */
#  define SMSTS_CMPF_VAL1                    (2 << SMSTS_CMPF_SHIFT)   /* A compare event has occurred for VAL1 value */
#  define SMSTS_CMPF_VAL2                    (4 << SMSTS_CMPF_SHIFT)   /* A compare event has occurred for VAL2 value */
#  define SMSTS_CMPF_VAL3                    (8 << SMSTS_CMPF_SHIFT)   /* A compare event has occurred for VAL3 value */
#  define SMSTS_CMPF_VAL4                    (16 << SMSTS_CMPF_SHIFT)  /* A compare event has occurred for VAL4 value */
#  define SMSTS_CMPF_VAL5                    (32 << SMSTS_CMPF_SHIFT)  /* A compare event has occurred for VAL5 value */
#define SMSTS_CFX0                           (1 << 6)   /* Bit: 6  Capture Flag X0 */
#define SMSTS_CFX1                           (1 << 7)   /* Bit: 7  Capture Flag X1 */
#define SMSTS_CFB0                           (1 << 8)   /* Bit: 8  Capture Flag B0 */
#define SMSTS_CFB1                           (1 << 9)   /* Bit: 9  Capture Flag B1 */
#define SMSTS_CFA0                           (1 << 10)  /* Bit: 10 Capture Flag A0 */
#define SMSTS_CFA1                           (1 << 11)  /* Bit: 11 Capture Flag A1 */
#define SMSTS_RF                             (1 << 12)  /* Bit: 12 Reload Flag */
#define SMSTS_REF                            (1 << 13)  /* Bit: 13 Reload Error Flag */
#define SMSTS_RUF                            (1 << 14)  /* Bit: 14 This read-only flag is set when one of the INIT, VALx,FRACVALx, or CTRL[PRSC] is written */
                                                        /* Bit: 15 Reserved */

/* Interrupt Enable Register */

#define SMINTEN_CMPIE_SHIFT                  (0)        /* Bits: 0-5  Compare Interrupt Enables */
#define SMINTEN_CMPIE_MASK                   (0x3f << SMINTEN_CMPIE_SHIFT)
#  define SMINTEN_CMPIE(n)                   ((uint32_t)(n) << SMINTEN_CMPIE_SHIFT)
#  define SMINTEN_CMPIE_VAL0                 (1 << SMINTEN_CMPIE_SHIFT)  /* A compare event for VAL0 value will generate an interrupt */
#  define SMINTEN_CMPIE_VAL1                 (2 << SMINTEN_CMPIE_SHIFT)  /* A compare event for VAL1 value will generate an interrupt */
#  define SMINTEN_CMPIE_VAL2                 (4 << SMINTEN_CMPIE_SHIFT)  /* A compare event for VAL2 value will generate an interrupt */
#  define SMINTEN_CMPIE_VAL3                 (8 << SMINTEN_CMPIE_SHIFT)  /* A compare event for VAL3 value will generate an interrupt */
#  define SMINTEN_CMPIE_VAL4                 (16 << SMINTEN_CMPIE_SHIFT)  /* A compare event for VAL4 value will generate an interrupt  */
#  define SMINTEN_CMPIE_VAL5                 (32 << SMINTEN_CMPIE_SHIFT)  /* A compare event for VAL5 value will generate an interrupt  */
#define SMINTEN_CX0IE                        (1 << 6)   /* Bit: 6  Capture X 0 Interrupt Enable */
#define SMINTEN_CX1IE                        (1 << 7)   /* Bit: 7  Capture X 1 Interrupt Enable */
#define SMINTEN_CB0IE                        (1 << 8)   /* Bit: 8  Capture B 0 Interrupt Enable */
#define SMINTEN_CB1IE                        (1 << 9)   /* Bit: 9  Capture B 1 Interrupt Enable */
#define SMINTEN_CA0IE                        (1 << 10)  /* Bit: 10 Capture A 0 Interrupt Enable */
#define SMINTEN_CA1IE                        (1 << 11)  /* Bit: 11 Capture A 1 Interrupt Enable */
#define SMINTEN_RIE                          (1 << 12)  /* Bit: 12 Reload Interrupt Enable */
#define SMINTEN_REIE                         (1 << 13)  /* Bit: 13 Reload Error Interrupt Enable */
                                                        /* Bits: 14-15 Reserved */

/* DMA Enable Register */

