apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
#define SMDMAEN_CX0DE                        (1 << 0)   /* Bit: 0  Capture X0 FIFO DMA Enable */
#define SMDMAEN_CX1DE                        (1 << 1)   /* Bit: 1  Capture X1 FIFO DMA Enable */
#define SMDMAEN_CB0DE                        (1 << 2)   /* Bit: 2  Capture B0 FIFO DMA Enable */
#define SMDMAEN_CB1DE                        (1 << 3)   /* Bit: 3  Capture B1 FIFO DMA Enable */
#define SMDMAEN_CA0DE                        (1 << 4)   /* Bit: 4  Capture A0 FIFO DMA Enable */
#define SMDMAEN_CA1DE                        (1 << 5)   /* Bit: 5  Capture A1 FIFO DMA Enable */
#define SMDMAEN_CAPTDE_SHIFT                 (6)        /* Bits: 6-7  Capture DMA Enable Source Select */
#define SMDMAEN_CAPTDE_MASK                  (3 << SMDMAEN_CAPTDE_SHIFT)
#  define SMDMAEN_CAPTDE(n)                  ((uint32_t)(n) << SMDMAEN_CAPTDE_SHIFT)
#  define SMDMAEN_CAPTDE_DIS                 (0 << SMDMAEN_CAPTDE_SHIFT)  /* Read DMA requests disabled. */
#  define SMDMAEN_CAPTDE_WMT                 (1 << SMDMAEN_CAPTDE_SHIFT)  /* Exceeding a FIFO watermark sets the DMA read request. */
#  define SMDMAEN_CAPTDE_SYNC                (2 << SMDMAEN_CAPTDE_SHIFT)  /* A local sync (VAL1 matches counter) sets the read DMA request. */
#  define SMDMAEN_CAPTDE_RELOAD              (3 << SMDMAEN_CAPTDE_SHIFT)  /* A local reload (STS[RF] being set) sets the read DMA request. */
#define SMDMAEN_FAND                         (1 << 8)   /* Bit: 8  FIFO Watermark AND Control */
#define SMDMAEN_VALDE                        (1 << 9)   /* Bit: 9  Value Registers DMA Enable */
                                                        /* Bits: 10-15 Reserved */

/* Output Trigger Control Register */

#define SMT_OUT_TRIG_EN_SHIFT                (0)        /* Bits: 0-5  Output Trigger Enables */
#define SMT_OUT_TRIG_EN_MASK                 (0x3f << SMT_OUT_TRIG_EN_SHIFT)
#  define SMT_OUT_TRIG_EN(n)                 ((uint32_t)(n) << SMT_OUT_TRIG_EN_SHIFT)
#  define SMT_OUT_TRIG_EN_VAL0               (1 << SMT_OUT_TRIG_EN_SHIFT)   /* PWM_OUT_TRIGx will set when the counter value matches the VAL0 value */
#  define SMT_OUT_TRIG_EN_VAL1               (2 << SMT_OUT_TRIG_EN_SHIFT)   /* PWM_OUT_TRIGx will set when the counter value matches the VAL1 value */
#  define SMT_OUT_TRIG_EN_VAL2               (4 << SMT_OUT_TRIG_EN_SHIFT)   /* PWM_OUT_TRIGx will set when the counter value matches the VAL2 value */
#  define SMT_OUT_TRIG_EN_VAL3               (8 << SMT_OUT_TRIG_EN_SHIFT)   /* PWM_OUT_TRIGx will set when the counter value matches the VAL3 value */
#  define SMT_OUT_TRIG_EN_VAL4               (16 << SMT_OUT_TRIG_EN_SHIFT)  /* PWM_OUT_TRIGx will set when the counter value matches the VAL4 value */
#  define SMT_OUT_TRIG_EN_VAL5               (32 << SMT_OUT_TRIG_EN_SHIFT)  /* PWM_OUT_TRIGx will set when the counter value matches the VAL5 value */
                                                        /* Bits: 6-11 Reserved */
#define SMT_TRGFRQ                           (1 << 12)  /* Bit: 12 Trigger frequency */
                                                        /* Bit: 13 Reserved */
#define SMT_PWBOT1                           (1 << 14)  /* Bit: 14 Output Trigger 1 Source Select */
#  define SMT_PWBOT1_OUT_TRIG1               (0 << 14)  /* Route the PWM_OUT_TRIG1 signal to PWM_OUT_TRIG1 port */
#  define SMT_PWBOT1_PWMMB                   (1 << 14)  /* Route the PWMB output to the PWM_OUT_TRIG1 port */
#define SMT_PWBOT0                           (1 << 15)  /* Bit: 15 Output Trigger 0 Source Select */
#  define SMT_PWBOT0_OUT_TRIG0               (0 << 15)  /* Route the PWM_OUT_TRIG0 signal to PWM_OUT_TRIG0 port */
#  define SMT_PWBOT0_PWMMB                   (1 << 15)  /* Route the PWMA output to the PWM_OUT_TRIG0 port */

/* Fault Disable Mapping Register 0 */

#define SMD_DIS0A_SHIFT                      (0)        /* Bits: 0-3  PWM_A Fault Disable Mask 0 */
#define SMD_DIS0A_MASK                       (0xf << SMD_DIS0A_SHIFT)
#  define SMD_DIS0A(n)                       ((uint32_t)(n) << SMD_DIS0A_SHIFT)
#  define SMD_DIS0A_FAULT0                   (1 << SMD_DIS0A_SHIFT)  /* FAULT0 inputs of fault channel 0. */
#  define SMD_DIS0A_FAULT1                   (2 << SMD_DIS0A_SHIFT)  /* FAULT1 inputs of fault channel 0. */
#  define SMD_DIS0A_FAULT2                   (4 << SMD_DIS0A_SHIFT)  /* FAULT2 inputs of fault channel 0. */
#  define SMD_DIS0A_FAULT3                   (8 << SMD_DIS0A_SHIFT)  /* FAULT3 inputs of fault channel 0. */
#define SMD_DIS0B_SHIFT                      (4)        /* Bits: 4-7  PWM_B Fault Disable Mask 0 */
#define SMD_DIS0B_MASK                       (0xf << SMD_DIS0B_SHIFT)
#  define SMD_DIS0B(n)                       ((uint32_t)(n) << SMD_DIS0B_SHIFT)
#  define SMD_DIS0B_FAULT0                   (1 << SMD_DIS0B_SHIFT)  /* FAULT0 inputs of fault channel 0. */
#  define SMD_DIS0B_FAULT1                   (2 << SMD_DIS0B_SHIFT)  /* FAULT1 inputs of fault channel 0. */
#  define SMD_DIS0B_FAULT2                   (4 << SMD_DIS0B_SHIFT)  /* FAULT2 inputs of fault channel 0. */
#  define SMD_DIS0B_FAULT3                   (8 << SMD_DIS0B_SHIFT)  /* FAULT3 inputs of fault channel 0. */
#define SMD_DIS0X_SHIFT                      (8)        /* Bits: 8-11  PWM_X Fault Disable Mask 0 */
#define SMD_DIS0X_MASK                       (0xf << SMD_DIS0X_SHIFT)
#  define SMD_DIS0X(n)                       ((uint32_t)(n) << SMD_DIS0X_SHIFT)
#  define SMD_DIS0X_FAULT0                   (1 << SMD_DIS0X_SHIFT)  /* FAULT0 inputs of fault channel 0. */
#  define SMD_DIS0X_FAULT1                   (2 << SMD_DIS0X_SHIFT)  /* FAULT1 inputs of fault channel 0. */
#  define SMD_DIS0X_FAULT2                   (4 << SMD_DIS0X_SHIFT)  /* FAULT2 inputs of fault channel 0. */
#  define SMD_DIS0X_FAULT3                   (8 << SMD_DIS0X_SHIFT)  /* FAULT3 inputs of fault channel 0. */
                                                        /* Bits: 12-15 Reserved */

/* Fault Disable Mapping Register 1 */

#define SMD_DIS1A_SHIFT                      (0)        /* Bits: 0-3  PWM_A Fault Disable Mask 1 */
#define SMD_DIS1A_MASK                       (0xf << SMD_DIS1A_SHIFT)
#  define SMD_DIS1A(n)                       ((uint32_t)(n) << SMD_DIS1A_SHIFT)
#  define SMD_DIS1A_FAULT0                   (1 << SMD_DIS1A_SHIFT)  /* FAULT0 inputs of fault channel 1. */
#  define SMD_DIS1A_FAULT1                   (2 << SMD_DIS1A_SHIFT)  /* FAULT1 inputs of fault channel 1. */
#  define SMD_DIS1A_FAULT2                   (4 << SMD_DIS1A_SHIFT)  /* FAULT2 inputs of fault channel 1. */
#  define SMD_DIS1A_FAULT3                   (8 << SMD_DIS1A_SHIFT)  /* FAULT3 inputs of fault channel 1. */
#define SMD_DIS1B_SHIFT                      (4)        /* Bits: 4-7  PWM_B Fault Disable Mask 1 */
#define SMD_DIS1B_MASK                       (0xf << SMD_DIS1B_SHIFT)
#  define SMD_DIS1B(n)                       ((uint32_t)(n) << SMD_DIS1B_SHIFT)
#  define SMD_DIS1B_FAULT0                   (1 << SMD_DIS1B_SHIFT)  /* FAULT0 inputs of fault channel 1. */
#  define SMD_DIS1B_FAULT1                   (2 << SMD_DIS1B_SHIFT)  /* FAULT1 inputs of fault channel 1. */
#  define SMD_DIS1B_FAULT2                   (4 << SMD_DIS1B_SHIFT)  /* FAULT2 inputs of fault channel 1. */
#  define SMD_DIS1B_FAULT3                   (8 << SMD_DIS1B_SHIFT)  /* FAULT3 inputs of fault channel 1. */
#define SMD_DIS1X_SHIFT                      (8)        /* Bits: 8-11  PWM_X Fault Disable Mask 1 */
#define SMD_DIS1X_MASK                       (0xf << SMD_DIS1X_SHIFT)
#  define SMD_DIS1X(n)                       ((uint32_t)(n) << SMD_DIS1X_SHIFT)
#  define SMD_DIS1X_FAULT0                   (1 << SMD_DIS1X_SHIFT)  /* FAULT0 inputs of fault channel 1. */
#  define SMD_DIS1X_FAULT1                   (2 << SMD_DIS1X_SHIFT)  /* FAULT1 inputs of fault channel 1. */
#  define SMD_DIS1X_FAULT2                   (4 << SMD_DIS1X_SHIFT)  /* FAULT2 inputs of fault channel 1. */
#  define SMD_DIS1X_FAULT3                   (8 << SMD_DIS1X_SHIFT)  /* FAULT3 inputs of fault channel 1. */
                                                        /* Bits: 12-15 Reserved */

/* Capture Control A Register */

