apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
#define SMC_ARMA                             (1 << 0)   /* Bit: 0  Arm A */
#define SMC_ONESHOTA                         (1 << 1)   /* Bit: 1  One Shot Mode A */
#define SMC_EDGA0_SHIFT                      (2)        /* Bits: 2-3  Edge A 0 */
#define SMC_EDGA0_MASK                       (3 << SMC_EDGA0_SHIFT)
#  define SMC_EDGA0(n)                       ((uint32_t)(n) << SMC_EDGA0_SHIFT)
#  define SMC_EDGA0_DIS                      (0 << SMC_EDGA0_SHIFT)  /* Disabled */
#  define SMC_EDGA0_FALLING                  (1 << SMC_EDGA0_SHIFT)  /* Capture falling edges */
#  define SMC_EDGA0_RISING                   (2 << SMC_EDGA0_SHIFT)  /* Capture rising edges */
#  define SMC_EDGA0_BOTH                     (3 << SMC_EDGA0_SHIFT)  /* Capture any edge */
#define SMC_EDGA1_SHIFT                      (4)        /* Bits: 4-5  Edge A 1 */
#define SMC_EDGA1_MASK                       (3 << SMC_EDGA1_SHIFT)
#  define SMC_EDGA1(n)                       ((uint32_t)(n) << SMC_EDGA1_SHIFT)
#  define SMC_EDGA1_DIS                      (0 << SMC_EDGA1_SHIFT)  /* Disabled */
#  define SMC_EDGA1_FALLING                  (1 << SMC_EDGA1_SHIFT)  /* Capture falling edges */
#  define SMC_EDGA1_RISING                   (2 << SMC_EDGA1_SHIFT)  /* Capture rising edges */
#  define SMC_EDGA1_BOTH                     (3 << SMC_EDGA1_SHIFT)  /* Capture any edge */
#define SMC_INP_SELA                         (1 << 6)   /* Bit: 6  Input Select A */
#define SMC_EDGCNTA_EN                       (1 << 7)   /* Bit: 7  Edge Counter A Enable */
#define SMC_CFAWM_SHIFT                      (8)        /* Bits: 8-9  Capture A FIFOs Water Mark */
#define SMC_CFAWM_MASK                       (3 << SMC_CFAWM_SHIFT)
#  define SMC_CFAWM(n)                       ((uint32_t)(n) << SMC_CFAWM_SHIFT)
#  define SMC_CFAWM_1                        (0 << SMC_CFAWM_SHIFT)  /* Water mark level of 1 for capture A FIFOs */
#  define SMC_CFAWM_2                        (1 << SMC_CFAWM_SHIFT)  /* Water mark level of 2 for capture A FIFOs */
#  define SMC_CFAWM_3                        (2 << SMC_CFAWM_SHIFT)  /* Water mark level of 3 for capture A FIFOs */
#  define SMC_CFAWM_4                        (3 << SMC_CFAWM_SHIFT)  /* Water mark level of 4 for capture A FIFOs */
#define SMC_CA0CNT_SHIFT                     (10)       /* Bits: 10-12  Capture A0 FIFO Word Count */
#define SMC_CA0CNT_MASK                      (7 << SMC_CA0CNT_SHIFT)
#  define SMC_CA0CNT(n)                      ((uint32_t)(n) << SMC_CA0CNT_SHIFT)
#  define SMC_CA0CNT_00                      (0 << SMC_CA0CNT_SHIFT)  /* 0 words in the Capture A0 FIFO. */
#  define SMC_CA0CNT_01                      (1 << SMC_CA0CNT_SHIFT)  /* 1 word in the Capture A0 FIFO.  */
#  define SMC_CA0CNT_02                      (2 << SMC_CA0CNT_SHIFT)  /* 2 words in the Capture A0 FIFO. */
#  define SMC_CA0CNT_03                      (3 << SMC_CA0CNT_SHIFT)  /* 3 words in the Capture A0 FIFO. */
#  define SMC_CA0CNT_04                      (4 << SMC_CA0CNT_SHIFT)  /* 4 words in the Capture A0 FIFO. */
#  define SMC_CA0CNT_05                      (5 << SMC_CA0CNT_SHIFT)  /* 5 words in the Capture A0 FIFO. */
#  define SMC_CA0CNT_06                      (6 << SMC_CA0CNT_SHIFT)  /* 6 words in the Capture A0 FIFO. */
#  define SMC_CA0CNT_07                      (7 << SMC_CA0CNT_SHIFT)  /* 7 words in the Capture A0 FIFO. */
#define SMC_CA1CNT_SHIFT                     (13)       /* Bits: 13-15  Capture A1 FIFO Word Count */
#define SMC_CA1CNT_MASK                      (7 << SMC_CA1CNT_SHIFT)
#  define SMC_CA1CNT(n)                      ((uint32_t)(n) << SMC_CA1CNT_SHIFT)
#  define SMC_CA1CNT_00                      (0 << SMC_CA1CNT_SHIFT)  /* 1 word in the Capture A1 FIFO. */
#  define SMC_CA1CNT_01                      (1 << SMC_CA1CNT_SHIFT)  /* 2 words in the Capture A1 FIFO. */
#  define SMC_CA1CNT_02                      (2 << SMC_CA1CNT_SHIFT)  /* 3 words in the Capture A1 FIFO. */
#  define SMC_CA1CNT_03                      (3 << SMC_CA1CNT_SHIFT)  /* 4 words in the Capture A1 FIFO. */
#  define SMC_CA1CNT_04                      (4 << SMC_CA1CNT_SHIFT)  /* 5 words in the Capture A1 FIFO. */
#  define SMC_CA1CNT_05                      (5 << SMC_CA1CNT_SHIFT)  /* 6 words in the Capture A1 FIFO. */
#  define SMC_CA1CNT_06                      (6 << SMC_CA1CNT_SHIFT)  /* 7 words in the Capture A1 FIFO. */
#  define SMC_CA1CNT_07                      (7 << SMC_CA1CNT_SHIFT)  /* 8 words in the Capture A1 FIFO. */

/* Capture Compare A Register */

#define SMC_EDGCMPA_SHIFT                    (0)        /* Bits: 0-7  Edge Compare A */
#define SMC_EDGCMPA_MASK                     (0xff << SMC_EDGCMPA_SHIFT)
#  define SMC_EDGCMPA(n)                     ((uint32_t)(n) << SMC_EDGCMPA_SHIFT)
#define SMC_EDGCNTA_SHIFT                    (8)        /* Bits: 8-15  Edge Counter A */
#define SMC_EDGCNTA_MASK                     (0xff << SMC_EDGCNTA_SHIFT)
#  define SMC_EDGCNTA(n)                     ((uint32_t)(n) << SMC_EDGCNTA_SHIFT)

/* Capture Control B Register */

#define SMC_ARMB                             (1 << 0)   /* Bit: 0  Arm B */
#define SMC_ONESHOTB                         (1 << 1)   /* Bit: 1  One Shot Mode B */
#define SMC_EDGB0_SHIFT                      (2)        /* Bits: 2-3  Edge B 0 */
#define SMC_EDGB0_MASK                       (3 << SMC_EDGB0_SHIFT)
#  define SMC_EDGB0(n)                       ((uint32_t)(n) << SMC_EDGB0_SHIFT)
#  define SMC_EDGB0_DIS                      (0 << SMC_EDGB0_SHIFT)  /* Disabled */
#  define SMC_EDGB0_FALLING                  (1 << SMC_EDGB0_SHIFT)  /* Capture falling edges */
#  define SMC_EDGB0_RISING                   (2 << SMC_EDGB0_SHIFT)  /* Capture rising edges */
#  define SMC_EDGB0_BOTH                     (3 << SMC_EDGB0_SHIFT)  /* Capture any edge */
#define SMC_EDGB1_SHIFT                      (4)        /* Bits: 4-5  Edge B 1 */
#define SMC_EDGB1_MASK                       (3 << SMC_EDGB1_SHIFT)
#  define SMC_EDGB1(n)                       ((uint32_t)(n) << SMC_EDGB1_SHIFT)
#  define SMC_EDGB1_DIS                      (0 << SMC_EDGB1_SHIFT)  /* Disabled */
#  define SMC_EDGB1_FALLING                  (1 << SMC_EDGB1_SHIFT)  /* Capture falling edges */
#  define SMC_EDGB1_RISING                   (2 << SMC_EDGB1_SHIFT)  /* Capture rising edges */
#  define SMC_EDGB1_BOTH                     (3 << SMC_EDGB1_SHIFT)  /* Capture any edge */
#define SMC_INP_SELB                         (1 << 6)   /* Bit: 6  Input Select B */
#define SMC_EDGCNTB_EN                       (1 << 7)   /* Bit: 7  Edge Counter B Enable */
#define SMC_CFBWM_SHIFT                      (8)        /* Bits: 8-9  Capture B FIFOs Water Mark */
#define SMC_CFBWM_MASK                       (3 << SMC_CFBWM_SHIFT)
#  define SMC_CFBWM(n)                       ((uint32_t)(n) << SMC_CFBWM_SHIFT)
#  define SMC_CFBWM_0                        (0 << SMC_CFBWM_SHIFT)  /* Water mark level of 1 for capture B FIFOs */
#  define SMC_CFBWM_1                        (1 << SMC_CFBWM_SHIFT)  /* Water mark level of 2 for capture B FIFOs */
#  define SMC_CFBWM_2                        (2 << SMC_CFBWM_SHIFT)  /* Water mark level of 3 for capture B FIFOs */
#  define SMC_CFBWM_3                        (3 << SMC_CFBWM_SHIFT)  /* Water mark level of 4 for capture B FIFOs */
#define SMC_CB0CNT_SHIFT                     (10)       /* Bits: 10-12  Capture B0 FIFO Word Count */
#define SMC_CB0CNT_MASK                      (7 << SMC_CB0CNT_SHIFT)
#  define SMC_CB0CNT(n)                      ((uint32_t)(n) << SMC_CB0CNT_SHIFT)
#  define SMC_CB0CNT_00                      (0 << SMC_CB0CNT_SHIFT)  /* 0 words in the Capture B0 FIFO. */
#  define SMC_CB0CNT_01                      (1 << SMC_CB0CNT_SHIFT)  /* 1 words in the Capture B0 FIFO. */
#  define SMC_CB0CNT_02                      (2 << SMC_CB0CNT_SHIFT)  /* 2 words in the Capture B0 FIFO. */
#  define SMC_CB0CNT_03                      (3 << SMC_CB0CNT_SHIFT)  /* 3 words in the Capture B0 FIFO. */
#  define SMC_CB0CNT_04                      (4 << SMC_CB0CNT_SHIFT)  /* 4 words in the Capture B0 FIFO. */
#  define SMC_CB0CNT_05                      (5 << SMC_CB0CNT_SHIFT)  /* 5 words in the Capture B0 FIFO. */
#  define SMC_CB0CNT_06                      (6 << SMC_CB0CNT_SHIFT)  /* 6 words in the Capture B0 FIFO. */
#  define SMC_CB0CNT_07                      (7 << SMC_CB0CNT_SHIFT)  /* 7 words in the Capture B0 FIFO. */
#define SMC_CB1CNT_SHIFT                     (13)       /* Bits: 13-15  Capture B1 FIFO Word Count */
#define SMC_CB1CNT_MASK                      (7 << SMC_CB1CNT_SHIFT)
#  define SMC_CB1CNT(n)                      ((uint32_t)(n) << SMC_CB1CNT_SHIFT)
#  define SMC_CB1CNT_00                      (0 << SMC_CB1CNT_SHIFT)  /* 0 words in the Capture B1 FIFO. */
#  define SMC_CB1CNT_01                      (1 << SMC_CB1CNT_SHIFT)  /* 1 words in the Capture B1 FIFO. */
#  define SMC_CB1CNT_02                      (2 << SMC_CB1CNT_SHIFT)  /* 2 words in the Capture B1 FIFO. */
#  define SMC_CB1CNT_03                      (3 << SMC_CB1CNT_SHIFT)  /* 3 words in the Capture B1 FIFO. */
#  define SMC_CB1CNT_04                      (4 << SMC_CB1CNT_SHIFT)  /* 4 words in the Capture B1 FIFO. */
#  define SMC_CB1CNT_05                      (5 << SMC_CB1CNT_SHIFT)  /* 5 words in the Capture B1 FIFO. */
#  define SMC_CB1CNT_06                      (6 << SMC_CB1CNT_SHIFT)  /* 6 words in the Capture B1 FIFO. */
#  define SMC_CB1CNT_07                      (7 << SMC_CB1CNT_SHIFT)  /* 7 words in the Capture B1 FIFO. */

/* Capture Compare B Register */

#define SMC_EDGCMPB_SHIFT                    (0)        /* Bits: 0-7  Edge Compare B */
#define SMC_EDGCMPB_MASK                     (0xff << SMC_EDGCMPB_SHIFT)
#  define SMC_EDGCMPB(n)                     ((uint32_t)(n) << SMC_EDGCMPB_SHIFT)
#define SMC_EDGCNTB_SHIFT                    (8)        /* Bits: 8-15  Edge Counter B */
#define SMC_EDGCNTB_MASK                     (0xff << SMC_EDGCNTB_SHIFT)
#  define SMC_EDGCNTB(n)                     ((uint32_t)(n) << SMC_EDGCNTB_SHIFT)

