apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
/* Capture Control X Register */

#define SMC_ARMX                             (1 << 0)   /* Bit: 0  Arm X */
#define SMC_ONESHOTX                         (1 << 1)   /* Bit: 1  One Shot Mode Aux */
#define SMC_EDGX0_SHIFT                      (2)        /* Bits: 2-3  Edge X 0 */
#define SMC_EDGX0_MASK                       (3 << SMC_EDGX0_SHIFT)
#  define SMC_EDGX0(n)                       ((uint32_t)(n) << SMC_EDGX0_SHIFT)
#  define SMC_EDGX0_DIS                      (0 << SMC_EDGX0_SHIFT)  /* Disabled */
#  define SMC_EDGX0_FALLING                  (1 << SMC_EDGX0_SHIFT)  /* Capture falling edges */
#  define SMC_EDGX0_RISING                   (2 << SMC_EDGX0_SHIFT)  /* Capture rising edges */
#  define SMC_EDGX0_BOTH                     (3 << SMC_EDGX0_SHIFT)  /* Capture any edge */
#define SMC_EDGX1_SHIFT                      (4)        /* Bits: 4-5  Edge X 1 */
#define SMC_EDGX1_MASK                       (3 << SMC_EDGX1_SHIFT)
#  define SMC_EDGX1(n)                       ((uint32_t)(n) << SMC_EDGX1_SHIFT)
#  define SMC_EDGX1_DIS                      (0 << SMC_EDGX1_SHIFT)  /* Disabled */
#  define SMC_EDGX1_FALLING                  (1 << SMC_EDGX1_SHIFT)  /* Capture falling edges */
#  define SMC_EDGX1_RISING                   (2 << SMC_EDGX1_SHIFT)  /* Capture rising edges */
#  define SMC_EDGX1_BOTH                     (3 << SMC_EDGX1_SHIFT)  /* Capture any edge */
#define SMC_INP_SELX                         (1 << 6)   /* Bit: 6  Input Select X */
#define SMC_EDGCNTX_EN                       (1 << 7)   /* Bit: 7  Edge Counter X Enable */
#define SMC_CFXWM_SHIFT                      (8)        /* Bits: 8-9  Capture X FIFOs Water Mark */
#define SMC_CFXWM_MASK                       (3 << SMC_CFXWM_SHIFT)
#  define SMC_CFXWM(n)                       ((uint32_t)(n) << SMC_CFXWM_SHIFT)
#  define SMC_CFXWM_1                        (0 << SMC_CFXWM_SHIFT)  /* Water mark level of 1 for capture X FIFOs */
#  define SMC_CFXWM_2                        (1 << SMC_CFXWM_SHIFT)  /* Water mark level of 2 for capture X FIFOs */
#  define SMC_CFXWM_3                        (2 << SMC_CFXWM_SHIFT)  /* Water mark level of 3 for capture X FIFOs */
#  define SMC_CFXWM_4                        (3 << SMC_CFXWM_SHIFT)  /* Water mark level of 4 for capture X FIFOs */
#define SMC_CX0CNT_SHIFT                     (10)       /* Bits: 10-12  Capture X0 FIFO Word Count */
#define SMC_CX0CNT_MASK                      (7 << SMC_CX0CNT_SHIFT)
#  define SMC_CX0CNT(n)                      ((uint32_t)(n) << SMC_CX0CNT_SHIFT)
#  define SMC_CX0CNT_00                      (0 << SMC_CX0CNT_SHIFT)  /* 0 words in the Capture X0 FIFO. */
#  define SMC_CX0CNT_01                      (1 << SMC_CX0CNT_SHIFT)  /* 1 word in the Capture X0 FIFO.  */
#  define SMC_CX0CNT_02                      (2 << SMC_CX0CNT_SHIFT)  /* 2 words in the Capture X0 FIFO. */
#  define SMC_CX0CNT_03                      (3 << SMC_CX0CNT_SHIFT)  /* 3 words in the Capture X0 FIFO. */
#  define SMC_CX0CNT_04                      (4 << SMC_CX0CNT_SHIFT)  /* 4 words in the Capture X0 FIFO. */
#  define SMC_CX0CNT_05                      (5 << SMC_CX0CNT_SHIFT)  /* 5 words in the Capture X0 FIFO. */
#  define SMC_CX0CNT_06                      (6 << SMC_CX0CNT_SHIFT)  /* 6 words in the Capture X0 FIFO. */
#  define SMC_CX0CNT_07                      (7 << SMC_CX0CNT_SHIFT)  /* 7 words in the Capture X0 FIFO. */
#define SMC_CX1CNT_SHIFT                     (13)       /* Bits: 13-15  Capture X1 FIFO Word Count */
#define SMC_CX1CNT_MASK                      (7 << SMC_CX1CNT_SHIFT)
#  define SMC_CX1CNT(n)                      ((uint32_t)(n) << SMC_CX1CNT_SHIFT)
#  define SMC_CX1CNT_00                      (0 << SMC_CX1CNT_SHIFT)  /* 0 words in the Capture X1 FIFO. */
#  define SMC_CX1CNT_01                      (1 << SMC_CX1CNT_SHIFT)  /* 1 word in the Capture  X1 FIFO.  */
#  define SMC_CX1CNT_02                      (2 << SMC_CX1CNT_SHIFT)  /* 2 words in the Capture X1 FIFO. */
#  define SMC_CX1CNT_03                      (3 << SMC_CX1CNT_SHIFT)  /* 3 words in the Capture X1 FIFO. */
#  define SMC_CX1CNT_04                      (4 << SMC_CX1CNT_SHIFT)  /* 4 words in the Capture X1 FIFO. */
#  define SMC_CX1CNT_05                      (5 << SMC_CX1CNT_SHIFT)  /* 5 words in the Capture X1 FIFO. */
#  define SMC_CX1CNT_06                      (6 << SMC_CX1CNT_SHIFT)  /* 6 words in the Capture X1 FIFO. */
#  define SMC_CX1CNT_07                      (7 << SMC_CX1CNT_SHIFT)  /* 7 words in the Capture X1 FIFO. */

/* Capture Compare X Register */

#define SMC_EDGCMPX_SHIFT                    (0)        /* Bits: 0-7  Edge Compare X */
#define SMC_EDGCMPX_MASK                     (0xff << SMC_EDGCMPX_SHIFT)
#  define SMC_EDGCMPX(n)                     ((uint32_t)(n) << SMC_EDGCMPX_SHIFT)
#define SMC_EDGCNTX_SHIFT                    (8)        /* Bits: 8-15  Edge Counter X */
#define SMC_EDGCNTX_MASK                     (0xff << SMC_EDGCNTX_SHIFT)
#  define SMC_EDGCNTX(n)                     ((uint32_t)(n) << SMC_EDGCNTX_SHIFT)

/* Capture Value 0 Cycle Register */

#define SMC_CVAL0CYC_SHIFT                   (0)        /* Bits: 0-3  CVAL0CYC */
#define SMC_CVAL0CYC_MASK                    (0xf << SMC_CVAL0CYC_SHIFT)
                                                        /* Bits: 4-15 Reserved */

/* Capture Value 1 Cycle Register */

#define SMC_CVAL1CYC_SHIFT                   (0)        /* Bits: 0-3  CVAL1CYC */
#define SMC_CVAL1CYC_MASK                    (0xf << SMC_CVAL1CYC_SHIFT)
                                                        /* Bits: 4-15 Reserved */

/* Capture Value 2 Cycle Register */

#define SMC_CVAL2CYC_SHIFT                   (0)        /* Bits: 0-3  CVAL2CYC */
#define SMC_CVAL2CYC_MASK                    (0xf << SMC_CVAL2CYC_SHIFT)
                                                        /* Bits: 4-15 Reserved */

/* Capture Value 3 Cycle Register */

#define SMC_CVAL3CYC_SHIFT                   (0)        /* Bits: 0-3  CVAL3CYC */
#define SMC_CVAL3CYC_MASK                    (0xf << SMC_CVAL3CYC_SHIFT)
                                                        /* Bits: 4-15 Reserved */

