apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
/* Capture Value 4 Cycle Register */

#define SMC_CVAL4CYC_SHIFT                   (0)        /* Bits: 0-3  CVAL4CYC */
#define SMC_CVAL4CYC_MASK                    (0xf << SMC_CVAL4CYC_SHIFT)
                                                        /* Bits: 4-15 Reserved */

/* Capture Value 5 Cycle Register */

#define SMC_CVAL5CYC_SHIFT                   (0)        /* Bits: 0-3  CVAL5CYC */
#define SMC_CVAL5CYC_MASK                    (0xf << SMC_CVAL5CYC_SHIFT)
                                                        /* Bits: 4-15 Reserved */

/* Output Enable Register */

#define OUTEN_PWMX_EN_SHIFT                  (0)        /* Bits: 0-3  PWM_X Output Enables */
#define OUTEN_PWMX_EN_MASK                   (0xf << OUTEN_PWMX_EN_SHIFT)
#  define OUTEN_PWMX_EN(n)                   ((uint32_t)(n) << OUTEN_PWMX_EN_SHIFT)
#  define OUTEN_PWMX_EN_ALL_DIS              (0 << OUTEN_PWMX_EN_SHIFT)  /* All disabled */
#  define OUTEN_PWMX_EN_SM0                  (1 << OUTEN_PWMX_EN_SHIFT)  /* Enable the PWM_X outputs of submodules 0 */
#  define OUTEN_PWMX_EN_SM1                  (2 << OUTEN_PWMX_EN_SHIFT)  /* Enable the PWM_X outputs of submodules 1 */
#  define OUTEN_PWMX_EN_SM2                  (4 << OUTEN_PWMX_EN_SHIFT)  /* Enable the PWM_X outputs of submodules 2 */
#  define OUTEN_PWMX_EN_SM3                  (8 << OUTEN_PWMX_EN_SHIFT)  /* Enable the PWM_X outputs of submodules 3 */
#  define OUTEN_PWMX_EN_ALL_DIS              (0xf << OUTEN_PWMX_EN_SHIFT)  /* All enabled */
#define OUTEN_PWMB_EN_SHIFT                  (4)        /* Bits: 4-7  PWM_B Output Enables */
#define OUTEN_PWMB_EN_MASK                   (0xf << OUTEN_PWMB_EN_SHIFT)
#  define OUTEN_PWMB_EN(n)                   ((uint32_t)(n) << OUTEN_PWMB_EN_SHIFT)
#  define OUTEN_PWMB_EN_ALL_DIS              (0 << OUTEN_PWMB_EN_SHIFT)  /* All disabled */
#  define OUTEN_PWMB_EN_SM0                  (1 << OUTEN_PWMB_EN_SHIFT)  /* Enable the PWM_B outputs of submodules 0 */
#  define OUTEN_PWMB_EN_SM1                  (2 << OUTEN_PWMB_EN_SHIFT)  /* Enable the PWM_B outputs of submodules 1 */
#  define OUTEN_PWMB_EN_SM2                  (4 << OUTEN_PWMB_EN_SHIFT)  /* Enable the PWM_B outputs of submodules 2 */
#  define OUTEN_PWMB_EN_SM3                  (8 << OUTEN_PWMB_EN_SHIFT)  /* Enable the PWM_B outputs of submodules 3 */
#  define OUTEN_PWMB_EN_ALL_DIS              (0xf << OUTEN_PWMB_EN_SHIFT)  /* All enabled */
#define OUTEN_PWMA_EN_SHIFT                  (8)        /* Bits: 8-11  PWM_A Output Enables */
#define OUTEN_PWMA_EN_MASK                   (0xf << OUTEN_PWMA_EN_SHIFT)
#  define OUTEN_PWMA_EN(n)                   ((uint32_t)(n) << OUTEN_PWMA_EN_SHIFT)
#  define OUTEN_PWMA_EN_ALL_DIS              (0 << OUTEN_PWMA_EN_SHIFT)  /* All disabled */
#  define OUTEN_PWMA_EN_SM0                  (1 << OUTEN_PWMA_EN_SHIFT)  /* Enable the PWM_A outputs of submodules 0 */
#  define OUTEN_PWMA_EN_SM1                  (2 << OUTEN_PWMA_EN_SHIFT)  /* Enable the PWM_A outputs of submodules 1 */
#  define OUTEN_PWMA_EN_SM2                  (4 << OUTEN_PWMA_EN_SHIFT)  /* Enable the PWM_A outputs of submodules 2 */
#  define OUTEN_PWMA_EN_SM3                  (8 << OUTEN_PWMA_EN_SHIFT)  /* Enable the PWM_A outputs of submodules 3 */
#  define OUTEN_PWMA_EN_ALL_DIS              (0xf << OUTEN_PWMA_EN_SHIFT)  /* All enabled */
                                                        /* Bits: 12-15 Reserved */

/* Mask Register */

#define MASK_MASKX_SHIFT                     (0)        /* Bits: 0-3  PWM_X Masks */
#define MASK_MASKX_MASK                      (0xf << MASK_MASKX_SHIFT)
#  define MASK_MASKX(n)                      ((uint32_t)(n) << MASK_MASKX_SHIFT)
#  define MASK_MASKX_SM0                     (1 << MASK_MASKX_SHIFT)  /* Mask the PWM_X outputs of submodules 0 (forces output to 0) */
#  define MASK_MASKX_SM1                     (2 << MASK_MASKX_SHIFT)  /* Mask the PWM_X outputs of submodules 1 (forces output to 0) */
#  define MASK_MASKX_SM2                     (4 << MASK_MASKX_SHIFT)  /* Mask the PWM_X outputs of submodules 2 (forces output to 0) */
#  define MASK_MASKX_SM3                     (8 << MASK_MASKX_SHIFT)  /* Mask the PWM_X outputs of submodules 3 (forces output to 0) */
#define MASK_MASKB_SHIFT                     (4)        /* Bits: 4-7  PWM_B Masks */
#define MASK_MASKB_MASK                      (0xf << MASK_MASKB_SHIFT)
#  define MASK_MASKB(n)                      ((uint32_t)(n) << MASK_MASKB_SHIFT)
#  define MASK_MASKB_SM0                     (1 << MASK_MASKB_SHIFT)  /* Mask the PWM_B outputs of submodules 0 (forces output to 0) */
#  define MASK_MASKB_SM1                     (2 << MASK_MASKB_SHIFT)  /* Mask the PWM_B outputs of submodules 1 (forces output to 0) */
#  define MASK_MASKB_SM2                     (4 << MASK_MASKB_SHIFT)  /* Mask the PWM_B outputs of submodules 2 (forces output to 0) */
#  define MASK_MASKB_SM3                     (8 << MASK_MASKB_SHIFT)  /* Mask the PWM_B outputs of submodules 3 (forces output to 0) */
#define MASK_MASKA_SHIFT                     (8)        /* Bits: 8-11  PWM_A Masks */
#define MASK_MASKA_MASK                      (0xf << MASK_MASKB_SHIFT)
#  define MASK_MASKA(n)                      ((uint32_t)(n) << MASK_MASKA_SHIFT)
#  define MASK_MASKA_SM0                     (1 << MASK_MASKA_SHIFT)  /* Mask the PWM_A outputs of submodules 0 (forces output to 0) */
#  define MASK_MASKA_SM1                     (2 << MASK_MASKA_SHIFT)  /* Mask the PWM_A outputs of submodules 1 (forces output to 0) */
#  define MASK_MASKA_SM2                     (4 << MASK_MASKA_SHIFT)  /* Mask the PWM_A outputs of submodules 2 (forces output to 0) */
#  define MASK_MASKA_SM3                     (8 << MASK_MASKA_SHIFT)  /* Mask the PWM_A outputs of submodules 3 (forces output to 0) */
#define MASK_UPDATE_MASK_SHIFT               (12)       /* Bits: 12-15  Update Mask Bits Immediately */
#define MASK_UPDATE_MASK_MASK                (0xf << MASK_UPDATE_MASK_SHIFT)
#  define MASK_UPDATE_MASK(n)                ((uint32_t)(n) << MASK_UPDATE_MASK_SHIFT)
#  define MASK_UPDATE_MASK_SM0               (1 << MASK_UPDATE_MASK_SHIFT)  /* Immediate update operation on PWM_X output of submodules 0 */
#  define MASK_UPDATE_MASK_SM1               (2 << MASK_UPDATE_MASK_SHIFT)  /* Immediate update operation on PWM_X output of submodules 1 */
#  define MASK_UPDATE_MASK_SM2               (4 << MASK_UPDATE_MASK_SHIFT)  /* Immediate update operation on PWM_X output of submodules 2 */
#  define MASK_UPDATE_MASK_SM3               (8 << MASK_UPDATE_MASK_SHIFT)  /* Immediate update operation on PWM_X output of submodules 3 */

