apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
/* Software Controlled Output Register */

#define SWCOUT_SM0OUT45                      (1 << 0)   /* Bit: 0  Submodule 0 Software Controlled Output 45 */
#define SWCOUT_SM0OUT23                      (1 << 1)   /* Bit: 1  Submodule 0 Software Controlled Output 23 */
#define SWCOUT_SM1OUT45                      (1 << 2)   /* Bit: 2  Submodule 1 Software Controlled Output 45 */
#define SWCOUT_SM1OUT23                      (1 << 3)   /* Bit: 3  Submodule 1 Software Controlled Output 23 */
#define SWCOUT_SM2OUT45                      (1 << 4)   /* Bit: 4  Submodule 2 Software Controlled Output 45 */
#define SWCOUT_SM2OUT23                      (1 << 5)   /* Bit: 5  Submodule 2 Software Controlled Output 23 */
#define SWCOUT_SM3OUT45                      (1 << 6)   /* Bit: 6  Submodule 3 Software Controlled Output 45 */
#define SWCOUT_SM3OUT23                      (1 << 7)   /* Bit: 7  Submodule 3 Software Controlled Output 23 */
                                                        /* Bits: 8-15 Reserved */

/* PWM Source Select Register */

/* Register Bit Definitions *********************************************************/

#define DTSRCSEL_SM0SEL45_SHIFT              (0)        /* Bits: 0-1  Submodule 0 PWM45 Control Select */
#define DTSRCSEL_SM0SEL45_MASK               (3 << DTSRCSEL_SM0SEL45_SHIFT)
#  define DTSRCSEL_SM0SEL45(n)               ((uint32_t)(n) << DTSRCSEL_SM0SEL45_SHIFT)
#  define DTSRCSEL_SM0SEL45_NORM             (0 << DTSRCSEL_SM0SEL45_SHIFT)  /* Generated SM0PWM45 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM0SEL45_INVERT           (1 << DTSRCSEL_SM0SEL45_SHIFT)  /* Inverted generated SM0PWM45 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM0SEL45_SWCOUT           (2 << DTSRCSEL_SM0SEL45_SHIFT)  /* SWCOUT[SM0OUT45] is used by the deadtime logic. */
#  define DTSRCSEL_SM0SEL45_PWM0_EXTB        (3 << DTSRCSEL_SM0SEL45_SHIFT)  /* PWM0_EXTB signal is used by the deadtime logic. */
#define DTSRCSEL_SM0SEL23_SHIFT              (2)        /* Bits: 2-3  Submodule 0 PWM23 Control Select */
#define DTSRCSEL_SM0SEL23_MASK               (3 << DTSRCSEL_SM0SEL23_SHIFT)
#  define DTSRCSEL_SM0SEL23(n)               ((uint32_t)(n) << DTSRCSEL_SM0SEL23_SHIFT)
#  define DTSRCSEL_SM0SEL23_NORM             (0 << DTSRCSEL_SM0SEL23_SHIFT)  /* Generated SM0PWM23 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM0SEL23_INVERT           (1 << DTSRCSEL_SM0SEL23_SHIFT)  /* Inverted generated SM0PWM23 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM0SEL23_SWCOUT           (2 << DTSRCSEL_SM0SEL23_SHIFT)  /* SWCOUT[SM0OUT23] is used by the deadtime logic. */
#  define DTSRCSEL_SM0SEL23_PWM0_EXTA        (3 << DTSRCSEL_SM0SEL23_SHIFT)  /* PWM0_EXTA signal is used by the deadtime logic. */
#define DTSRCSEL_SM1SEL45_SHIFT              (4)        /* Bits: 4-5  Submodule 1 PWM45 Control Select */
#define DTSRCSEL_SM1SEL45_MASK               (3 << DTSRCSEL_SM1SEL45_SHIFT)
#  define DTSRCSEL_SM1SEL45(n)               ((uint32_t)(n) << DTSRCSEL_SM1SEL45_SHIFT)
#  define DTSRCSEL_SM1SEL45_NORM             (0 << DTSRCSEL_SM1SEL45_SHIFT)  /* Generated SM1PWM45 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM1SEL45_INVERT           (1 << DTSRCSEL_SM1SEL45_SHIFT)  /* Inverted generated SM1PWM45 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM1SEL45_SWCOUT           (2 << DTSRCSEL_SM1SEL45_SHIFT)  /* SWCOUT[SM1OUT45] is used by the deadtime logic. */
#  define DTSRCSEL_SM1SEL45_PWM1_EXTB        (3 << DTSRCSEL_SM1SEL45_SHIFT)  /* PWM1_EXTB signal is used by the deadtime logic. */
#define DTSRCSEL_SM1SEL23_SHIFT              (6)        /* Bits: 6-7  Submodule 1 PWM23 Control Select */
#define DTSRCSEL_SM1SEL23_MASK               (3 << DTSRCSEL_SM1SEL23_SHIFT)
#  define DTSRCSEL_SM1SEL23(n)               ((uint32_t)(n) << DTSRCSEL_SM1SEL23_SHIFT)
#  define DTSRCSEL_SM1SEL23_NORM             (0 << DTSRCSEL_SM1SEL23_SHIFT)  /* Generated SM1PWM23 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM1SEL23_INVERT           (1 << DTSRCSEL_SM1SEL23_SHIFT)  /* Inverted generated SM1PWM23 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM1SEL23_SWCOUT           (2 << DTSRCSEL_SM1SEL23_SHIFT)  /* SWCOUT[SM1OUT23] is used by the deadtime logic. */
#  define DTSRCSEL_SM1SEL23_PWM1_EXTA        (3 << DTSRCSEL_SM1SEL23_SHIFT)  /* PWM1_EXTA signal is used by the deadtime logic */
#define DTSRCSEL_SM2SEL45_SHIFT              (8)        /* Bits: 8-9  Submodule 2 PWM45 Control Select */
#define DTSRCSEL_SM2SEL45_MASK               (3 << DTSRCSEL_SM2SEL45_SHIFT)
#  define DTSRCSEL_SM2SEL45(n)               ((uint32_t)(n) << DTSRCSEL_SM2SEL45_SHIFT)
#  define DTSRCSEL_SM2SEL45_NORM             (0 << DTSRCSEL_SM2SEL45_SHIFT)  /* Generated SM2PWM45 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM2SEL45_INVERT           (1 << DTSRCSEL_SM2SEL45_SHIFT)  /* Inverted generated SM2PWM45 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM2SEL45_SWCOUT           (2 << DTSRCSEL_SM2SEL45_SHIFT)  /* SWCOUT[SM2OUT45] is used by the deadtime logic. */
#  define DTSRCSEL_SM2SEL45_PWM2_EXTB        (3 << DTSRCSEL_SM2SEL45_SHIFT)  /* PWM2_EXTB signal is used by the deadtime logic. */
#define DTSRCSEL_SM2SEL23_SHIFT              (10)       /* Bits: 10-11  Submodule 2 PWM23 Control Select */
#define DTSRCSEL_SM2SEL23_MASK               (3 << DTSRCSEL_SM2SEL23_SHIFT)
#  define DTSRCSEL_SM2SEL23(n)               ((uint32_t)(n) << DTSRCSEL_SM2SEL23_SHIFT)
#  define DTSRCSEL_SM2SEL23_NORM             (0 << DTSRCSEL_SM2SEL23_SHIFT)  /* Generated SM2PWM23 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM2SEL23_INVERT           (1 << DTSRCSEL_SM2SEL23_SHIFT)  /* Inverted generated SM2PWM23 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM2SEL23_SWCOUT           (2 << DTSRCSEL_SM2SEL23_SHIFT)  /* SWCOUT[SM2OUT23] is used by the deadtime logic. */
#  define DTSRCSEL_SM2SEL23_PWM2_EXTA        (3 << DTSRCSEL_SM2SEL23_SHIFT)  /* PWM2_EXTA signal is used by the deadtime logic */
#define DTSRCSEL_SM3SEL45_SHIFT              (12)       /* Bits: 12-13  Submodule 3 PWM45 Control Select */
#define DTSRCSEL_SM3SEL45_MASK               (3 << DTSRCSEL_SM3SEL45_SHIFT)
#  define DTSRCSEL_SM3SEL45(n)               ((uint32_t)(n) << DTSRCSEL_SM3SEL45_SHIFT)
#  define DTSRCSEL_SM3SEL45_NORM             (0 << DTSRCSEL_SM3SEL45_SHIFT)  /* Generated SM3PWM45 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM3SEL45_INVERT           (1 << DTSRCSEL_SM3SEL45_SHIFT)  /* Inverted generated SM3PWM45 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM3SEL45_SWCOUT           (2 << DTSRCSEL_SM3SEL45_SHIFT)  /* SWCOUT[SM3OUT45] is used by the deadtime logic. */
#  define DTSRCSEL_SM3SEL45_PWM3_EXTB        (3 << DTSRCSEL_SM3SEL45_SHIFT)  /* PWM3_EXTB signal is used by the deadtime logic. */
#define DTSRCSEL_SM3SEL23_SHIFT              (14)       /* Bits: 14-15  Submodule 3 PWM23 Control Select */
#define DTSRCSEL_SM3SEL23_MASK               (3 << DTSRCSEL_SM3SEL23_SHIFT)
#  define DTSRCSEL_SM3SEL23(n)               ((uint32_t)(n) << DTSRCSEL_SM3SEL23_SHIFT)
#  define DTSRCSEL_SM3SEL23_NORM             (0 << DTSRCSEL_SM3SEL23_SHIFT)  /* Generated SM3PWM23 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM3SEL23_INVERT           (1 << DTSRCSEL_SM3SEL23_SHIFT)  /* Inverted generated SM3PWM23 signal is used by the deadtime logic. */
#  define DTSRCSEL_SM3SEL23_SWCOUT           (2 << DTSRCSEL_SM3SEL23_SHIFT)  /* SWCOUT[SM3OUT23] is used by the deadtime logic. */
#  define DTSRCSEL_SM3SEL23_PWM3_EXTA        (3 << DTSRCSEL_SM3SEL23_SHIFT)  /* PWM3_EXTA signal is used by the deadtime logic. */

/* Master Control Register */

#define MCTRL_LDOK_SHIFT                     (0)        /* Bits: 0-3  Load Okay */
#define MCTRL_LDOK_MASK                      (15 << MCTRL_LDOK_SHIFT)
#  define MCTRL_LDOK(n)                      ((uint32_t)(n) << MCTRL_LDOK_SHIFT)
#  define MCTRL_LDOK_SM0                     (1 << MCTRL_LDOK_SHIFT)  /* Load prescaler, modulus, and PWM values of submodule 0 */
#  define MCTRL_LDOK_SM1                     (2 << MCTRL_LDOK_SHIFT)  /* Load prescaler, modulus, and PWM values of submodule 1 */
#  define MCTRL_LDOK_SM2                     (4 << MCTRL_LDOK_SHIFT)  /* Load prescaler, modulus, and PWM values of submodule 2 */
#  define MCTRL_LDOK_SM3                     (8 << MCTRL_LDOK_SHIFT)  /* Load prescaler, modulus, and PWM values of submodule 3 */
#define MCTRL_CLDOK_SHIFT                    (4)        /* Bits: 4-7  Clear Load Okay */
#define MCTRL_CLDOK_MASK                     (15 << MCTRL_CLDOK_SHIFT)
#  define MCTRL_CLDOK(n)                     ((uint32_t)(n) << MCTRL_CLDOK_SHIFT)
#  define MCTRL_CLDOK_SM0                    (1 << MCTRL_CLDOK_SHIFT)  /*  Clear Load Okay of submodule 0 */
#  define MCTRL_CLDOK_SM1                    (2 << MCTRL_CLDOK_SHIFT)  /*  Clear Load Okay of submodule 1 */
#  define MCTRL_CLDOK_SM2                    (4 << MCTRL_CLDOK_SHIFT)  /*  Clear Load Okay of submodule 2 */
#  define MCTRL_CLDOK_SM3                    (8 << MCTRL_CLDOK_SHIFT)  /*  Clear Load Okay of submodule 3 */
#define MCTRL_RUN_SHIFT                      (8)        /* Bits: 8-11  Run */
#define MCTRL_RUN_MASK                       (15 << MCTRL_RUN_SHIFT)
#  define MCTRL_RUN(n)                       ((uint32_t)(n) << MCTRL_RUN_SHIFT)
#  define MCTRL_RUN_SM0                      (1 << MCTRL_RUN_SHIFT)  /* Enable PWM generator of submodules 0 */
#  define MCTRL_RUN_SM1                      (2 << MCTRL_RUN_SHIFT)  /* Enable PWM generator of submodules 1 */
#  define MCTRL_RUN_SM2                      (4 << MCTRL_RUN_SHIFT)  /* Enable PWM generator of submodules 2 */
#  define MCTRL_RUN_SM3                      (8 << MCTRL_RUN_SHIFT)  /* Enable PWM generator of submodules 3 */
#define MCTRL_IPOL_SHIFT                     (12)       /* Bits: 12-15  Current Polarity */
#define MCTRL_IPOL_MASK                      (15 << MCTRL_IPOL_SHIFT)
#  define MCTRL_IPOL(n)                      ((uint32_t)(n) << MCTRL_IPOL_SHIFT)
#  define MCTRL_IPOL_SM0                     (1 << MCTRL_IPOL_SHIFT)  /* PWM45 is used to generate complementary PWM pair in submodule 0. */
#  define MCTRL_IPOL_SM1                     (2 << MCTRL_IPOL_SHIFT)  /* PWM45 is used to generate complementary PWM pair in submodule 1. */
#  define MCTRL_IPOL_SM2                     (4 << MCTRL_IPOL_SHIFT)  /* PWM45 is used to generate complementary PWM pair in submodule 2. */
#  define MCTRL_IPOL_SM3                     (8 << MCTRL_IPOL_SHIFT)  /* PWM45 is used to generate complementary PWM pair in submodule 3. */

/* Master Control 2 Register */

/* Register Bit Definitions *********************************************************/

#define MCTRL2_MONPLL_SHIFT                  (0)        /* Bits: 0-1  Monitor PLL State */
#define MCTRL2_MONPLL_MASK                   (3 << MCTRL2_MONPLL_SHIFT)
#  define MCTRL2_MONPLL(n)                   ((uint32_t)(n) << MCTRL2_MONPLL_SHIFT)
#  define MCTRL2_MONPLL_NOT_LOCKED           (0 << MCTRL2_MONPLL_SHIFT)  /* Not locked. Do not monitor PLL operation. */
#  define MCTRL2_MONPLL_NOT_LOCKED_NONITOR   (1 << MCTRL2_MONPLL_SHIFT)  /* Not locked. Monitor PLL operation. */
#  define MCTRL2_MONPLL_LOCKED               (2 << MCTRL2_MONPLL_SHIFT)  /* Locked. Do not monitor PLL operation. */
#  define MCTRL2_MONPLL_LOCKED_NONITOR       (3 << MCTRL2_MONPLL_SHIFT)  /* Locked. Monitor PLL operation */

/* Fault Control Register */

#define FCTRL_FIE_SHIFT                      (0)        /* Bits: 0-3  Fault Interrupt Enables */
#define FCTRL_FIE_MASK                       (15 << FCTRL_FIE_SHIFT)
#  define FCTRL_FIE(n)                       ((uint32_t)(n) << FCTRL_FIE_SHIFT)
#  define FCTRL_FIE_ALL_DIS                  (0 << FCTRL_FIE_SHIFT)  /* All Normal mode. PWM outputs disabled by this fault are not enabled */
#  define FCTRL_FIE_FAULT0                   (1 << FCTRL_FIE_SHIFT)  /* FAULT0 Safe mode. PWM outputs disabled by this fault */
#  define FCTRL_FIE_FAULT1                   (2 << FCTRL_FIE_SHIFT)  /* FAULT1 Safe mode. PWM outputs disabled by this fault */
#  define FCTRL_FIE_FAULT2                   (4 << FCTRL_FIE_SHIFT)  /* FAULT2 Safe mode. PWM outputs disabled by this fault */
#  define FCTRL_FIE_FAULT3                   (8 << FCTRL_FIE_SHIFT)  /* FAULT3 Safe mode. PWM outputs disabled by this fault */
#define FCTRL0_FSAFE_SHIFT                   (4)        /* Bits: 4-7  Fault Safety Mode */
#define FCTRL0_FSAFE_MASK                    (15 << FCTRL0_FSAFE_SHIFT)
#  define FCTRL0_FSAFE(n)                    ((uint32_t)(n) << FCTRL0_FSAFE_SHIFT)
#  define FCTRL0_FSAFE_ALL_DIS               (0 << FCTRL0_FSAFE_SHIFT)  /* All FAULT CPU interrupt requests disabled */
#  define FCTRL0_FSAFE_FAULT0                (1 << FCTRL0_FSAFE_SHIFT)  /* FAULT0 CPU interrupt requests enabled */
#  define FCTRL0_FSAFE_FAULT1                (2 << FCTRL0_FSAFE_SHIFT)  /* FAULT1 CPU interrupt requests enabled */
#  define FCTRL0_FSAFE_FAULT2                (4 << FCTRL0_FSAFE_SHIFT)  /* FAULT2 CPU interrupt requests enabled */
#  define FCTRL0_FSAFE_FAULT3                (8 << FCTRL0_FSAFE_SHIFT)  /* FAULT3 CPU interrupt requests enabled */
#define FCTRL0_FAUTO_SHIFT                   (8)        /* Bits: 8-11  Automatic Fault Clearing */
#define FCTRL0_FAUTO_MASK                    (15 << FCTRL0_FAUTO_SHIFT)
#  define FCTRL0_FAUTO(n)                    ((uint32_t)(n) << FCTRL0_FAUTO_SHIFT)
#  define FCTRL0_FAUTO_ALL_MANUAL            (0 << FCTRL0_FAUTO_SHIFT)  /* All Manual fault clearing */
#  define FCTRL0_FAUTO_FAULT0                (1 << FCTRL0_FAUTO_SHIFT)  /* FAULT0 Automatic fault clearing. */
#  define FCTRL0_FAUTO_FAULT1                (2 << FCTRL0_FAUTO_SHIFT)  /* FAULT1 Automatic fault clearing. */
#  define FCTRL0_FAUTO_FAULT2                (4 << FCTRL0_FAUTO_SHIFT)  /* FAULT2 Automatic fault clearing. */
#  define FCTRL0_FAUTO_FAULT3                (8 << FCTRL0_FAUTO_SHIFT)  /* FAULT3 Automatic fault clearing. */
#define FCTRL0_FLVL_SHIFT                    (12)       /* Bits: 12-15  Fault Level */
#define FCTRL0_FLVL_MASK                     (15 << FCTRL0_FLVL_SHIFT)
#  define FCTRL0_FLVL(n)                     ((uint32_t)(n) << FCTRL0_FLVL_SHIFT)
#  define FCTRL0_FLVL_ALL_FAULT_LOW          (0 << FCTRL0_FLVL_SHIFT)  /* A logic 0 on the ALL fault input indicates a fault condition */
#  define FCTRL0_FLVL_FAULT0                 (1 << FCTRL0_FLVL_SHIFT)  /* A logic 1 on the FAULT0 input indicates a fault condition */
#  define FCTRL0_FLVL_FAULT1                 (2 << FCTRL0_FLVL_SHIFT)  /* A logic 1 on the FAULT1 input indicates a fault condition */
#  define FCTRL0_FLVL_FAULT2                 (4 << FCTRL0_FLVL_SHIFT)  /* A logic 1 on the FAULT2 input indicates a fault condition */
#  define FCTRL0_FLVL_FAULT3                 (8 << FCTRL0_FLVL_SHIFT)  /* A logic 1 on the FAULT3 input indicates a fault condition */

/* Fault Status Register */

