apache/nuttx/arch/arm/src/imxrt/chip/imxrt_flexpwm.h
#define FSTS_FFLAG_SHIFT                     (0)        /* Bits: 0-3  Fault Flags */
#define FSTS_FFLAG_MASK                      (15 << FSTS_FFLAG_SHIFT)
#  define FSTS_FFLAG(n)                      ((uint32_t)(n) << FSTS_FFLAG_SHIFT)
#  define FSTS_FFLAG_ALL_NO_FAULT            (0 << FSTS_FFLAG_SHIFT)  /* No fault on the ALL of the FAULT pins */
#  define FSTS_FFLAG_FAULT0                  (1 << FSTS_FFLAG_SHIFT)  /* Fault on the FAULT0 pin */
#  define FSTS_FFLAG_FAULT1                  (2 << FSTS_FFLAG_SHIFT)  /* Fault on the FAULT1 pin */
#  define FSTS_FFLAG_FAULT2                  (4 << FSTS_FFLAG_SHIFT)  /* Fault on the FAULT2 pin */
#  define FSTS_FFLAG_FAULT3                  (8 << FSTS_FFLAG_SHIFT)  /* Fault on the FAULT3 pin */
#define FSTS_FFULL_SHIFT                     (4)        /* Bits: 4-7  Full Cycle */
#define FSTS_FFULL_MASK                      (15 << FSTS_FFULL_SHIFT)
#  define FSTS_FFULL(n)                      ((uint32_t)(n) << FSTS_FFULL_SHIFT)
#  define FSTS_FFULL_ALL_NOT_REENABLED       (0 << FSTS_FFULL_SHIFT)  /* All PWM outputs are not re-enabled at the start of a full cycle */
#  define FSTS_FFULL_SM0                     (1 << FSTS_FFULL_SHIFT)  /* SM0 PWM output is re-enabled at the start of a full cycle */
#  define FSTS_FFULL_SM1                     (2 << FSTS_FFULL_SHIFT)  /* SM1 PWM output is re-enabled at the start of a full cycle */
#  define FSTS_FFULL_SM2                     (4 << FSTS_FFULL_SHIFT)  /* SM2 PWM output is re-enabled at the start of a full cycle */
#  define FSTS_FFULL_SM3                     (8 << FSTS_FFULL_SHIFT)  /* SM3 PWM output is re-enabled at the start of a full cycle */
#define FSTS_FFPIN_SHIFT                     (8)        /* Bits: 8-11  Filtered Fault Pins */
#define FSTS_FFPIN_MASK                      (15 << FSTS_FFPIN_SHIFT)
#  define FSTS_FFPIN(n)                      ((uint32_t)(n) << FSTS_FFPIN_SHIFT)
#  define FSTS_FFPIN_ALL_NO_FAULT            (0 << FSTS_FFPIN_SHIFT)  /* No Faults as current state of the filtered FAULT pins */
#  define FSTS_FFPIN_FAULT0                  (1 << FSTS_FFPIN_SHIFT)  /* This read-only bit reflect the current state of the filtered FAULT0 pin */
#  define FSTS_FFPIN_FAULT1                  (2 << FSTS_FFPIN_SHIFT)  /* This read-only bit reflect the current state of the filtered FAULT1 pin */
#  define FSTS_FFPIN_FAULT2                  (4 << FSTS_FFPIN_SHIFT)  /* This read-only bit reflect the current state of the filtered FAULT2 pin */
#  define FSTS_FFPIN_FAULT3                  (8 << FSTS_FFPIN_SHIFT)  /* This read-only bit reflect the current state of the filtered FAULT3 pin */
#define FSTS_FHALF_SHIFT                     (12)       /* Bits: 12-15  Half Cycle Fault Recovery */
#define FSTS_FHALF_MASK                      (15 << FSTS_FHALF_SHIFT)
#  define FSTS_FHALF(n)                      ((uint32_t)(n) << FSTS_FHALF_SHIFT)
#  define FSTS_FHALF_ALL_NOT_REENABLED       (0 << FSTS_FHALF_SHIFT)  /* All PWM outputs are not re-enabled at the start of a half cycle */
#  define FSTS_FHALF_SM0                     (1 << FSTS_FHALF_SHIFT)  /* SM0 PWM output is re-enabled at the start of a half cycle (as defined by VAL0).*/
#  define FSTS_FHALF_SM1                     (2 << FSTS_FHALF_SHIFT)  /* SM1 PWM output is re-enabled at the start of a half cycle (as defined by VAL0).*/
#  define FSTS_FHALF_SM2                     (4 << FSTS_FHALF_SHIFT)  /* SM2 PWM output is re-enabled at the start of a half cycle (as defined by VAL0).*/
#  define FSTS_FHALF_SM3                     (8 << FSTS_FHALF_SHIFT)  /* SM3 PWM output is re-enabled at the start of a half cycle (as defined by VAL0).*/

/* Fault Filter Register */

#define FFILT_FILT_PER_SHIFT                 (0)        /* Bits: 0-7  Fault Filter Period */
#define FFILT_FILT_PER_MASK                  (0xff << FFILT_FILT_PER_SHIFT)
#  define FFILT_FILT_PER(n)                  ((uint32_t)(n) << FFILT_FILT_PER_SHIFT)
#define FFILT_FILT_CNT_SHIFT                 (8)        /* Bits: 8-10  Fault Filter Count */
#define FFILT_FILT_CNT_MASK                  (7 << FFILT_FILT_CNT_SHIFT)
#  define FFILT_FILT_CNT(n)                  ((uint32_t)(n) << FFILT_FILT_CNT_SHIFT)
#  define FFILT_FILT_CNT_3                   (0 << FFILT_FILT_CNT_SHIFT)  /* */
#  define FFILT_FILT_CNT_4                   (1 << FFILT_FILT_CNT_SHIFT)  /* */
#  define FFILT_FILT_CNT_5                   (2 << FFILT_FILT_CNT_SHIFT)  /* */
#  define FFILT_FILT_CNT_6                   (3 << FFILT_FILT_CNT_SHIFT)  /* */
#  define FFILT_FILT_CNT_7                   (4 << FFILT_FILT_CNT_SHIFT)  /* */
#  define FFILT_FILT_CNT_8                   (5 << FFILT_FILT_CNT_SHIFT)  /* */
#  define FFILT_FILT_CNT_9                   (6 << FFILT_FILT_CNT_SHIFT)  /* */
#  define FFILT_FILT_CNT_10                  (7 << FFILT_FILT_CNT_SHIFT)  /* */
                                                        /* Bits: 11-14 Reserved */
#define FFILT_GSTR                           (1 << 15)  /* Bit: 15 Fault Glitch Stretch Enable */

/* Fault Test Register */

#define FTST0_FTEST                          (1 << 0)   /* Bit: 0  Fault Test */
                                                        /* Bits: 1-15 Reserved */

/* Fault Control 2 Register */

#define FCTRL20_NOCOMB_SHIFT                 (0)        /* Bits: 0-3  No Combinational Path From Fault Input To PWM Output */
#define FCTRL20_NOCOMB_MASK                  (0xf << FCTRL20_NOCOMB_SHIFT)
#  define FCTRL20_NOCOMB(n)                  ((uint32_t)(n) << FCTRL20_NOCOMB_SHIFT)
#  define FCTRL20_NOCOMB_ALL_ENABLED         (0 << FCTRL20_NOCOMB_SHIFT)  /* All combinational link from the fault inputs to the PWM outputs are enabled */
#  define FCTRL20_NOCOMB_FAULT0              (1 << FCTRL20_NOCOMB_SHIFT)  /*  Disable direct combinational path from the FAULT0 input to the PWM output */
#  define FCTRL20_NOCOMB_FAULT1              (2 << FCTRL20_NOCOMB_SHIFT)  /*  Disable direct combinational path from the FAULT1 input to the PWM output */
#  define FCTRL20_NOCOMB_FAULT2              (4 << FCTRL20_NOCOMB_SHIFT)  /*  Disable direct combinational path from the FAULT2 input to the PWM output */
#  define FCTRL20_NOCOMB_FAULT3              (8 << FCTRL20_NOCOMB_SHIFT)  /*  Disable direct combinational path from the FAULT3 input to the PWM output */

#endif /* __ARCH_ARM_SRC_IMXRT_CHIP_IMXRT_FLEXPWM_H */
